import config from '../../config.cjs';

const ping = async (m, sock) => {
  const prefix = config.PREFIX;
const cmd = m.body.startsWith(prefix) ? m.body.slice(prefix.length).split(' ')[0].toLowerCase() : '';
const text = m.body.slice(prefix.length + cmd.length).trim();

  if (cmd === "menu") {
    const start = new Date().getTime();
    await m.React('📈');
    const end = new Date().getTime();
    const responseTime = (end - start) / 1000;

    const text = `┏━𒊹︎︎︎ 𝕐𝔼𝕊𝕊𝔼ℝ 𝕄𝔻 𒊹︎︎︎
┃༆𝕦𝕤𝕖𝕣 𝕟𝕒𝕞𝕖; bot
┃༆𝕔𝕠𝕞𝕞𝕒𝕟𝕕𝕤; 600   
┃༆𝕕𝕖𝕡𝕝𝕠𝕪𝕞𝕖𝕟𝕥; 𝚛𝚎𝚗𝚍𝚎𝚛
┃༆𝕞𝕠𝕕𝕖; 𝚙𝚞𝚋𝚕𝚒𝚌
┃༆𝕡𝕣𝕖𝕗𝕚𝕩; [•]
┃༆𝕓𝕠𝕥 𝕔𝕣𝕖𝕒𝕥𝕠𝕣; 𝚈𝙴𝚂𝚂𝙴𝚁𝚃𝙴𝙲𝙷
┗𒊹︎︎︎
┏𒊹︎︎ℂ𝕆ℕ𝕍..ఌ︎
┃✿︎ .𝙰𝚃𝚃𝙿
┃✿︎ .𝙰𝚃𝚃𝙿2
┃✿︎ .𝙰𝚃𝚃𝙿3
┃✿︎ .𝙴𝙱𝙸𝙽𝙰𝚁𝚈
┃✿︎ .𝙳𝙱𝙸𝙽𝙰𝚁𝚈
┃✿︎ .𝙴𝙼𝙾𝙹𝙸𝙼𝙸𝚇
┃✿︎ .𝙼𝙿3
┗𒊹︎︎︎
┏𒊹︎︎︎ 𝔸𝕀㋛︎ 
┃✔︎ .𝙰𝚒
┃✔︎ .𝙱𝚞𝚐
┃✔︎ .𝚁𝚎𝚙𝚘𝚛𝚝
┃✔︎ .𝙶𝚙𝚝
┃✔︎ .𝙳𝚊𝚕𝚕𝚎
┃✔︎ .𝚁𝚎𝚖𝚒𝚗𝚒
┃✔︎ .𝙶𝚎𝚖𝚒𝚗𝚒
┗𒊹︎︎︎
┏𒊹︎︎︎ 𝕋𝕆𝕆𝕃𝕊 ⌨︎
┃✈︎ .𝙲𝚊𝚕𝚌𝚞𝚕𝚊𝚝𝚘𝚛
┃✈︎ .𝚃𝚎𝚖𝚙𝚖𝚊𝚒𝚕
┃✈︎ .𝙲𝚑𝚎𝚌𝚔𝚖𝚊𝚒𝚕
┃✈︎ .𝚃𝚛𝚝
┃✈︎ .𝚃𝚝𝚜
┗𒊹︎︎︎
┏𒊹︎︎︎ 𝔾ℝ𝕆𝕌ℙ✍︎
┃☞︎︎︎ .𝙻𝚒𝚗𝚔𝙶𝚛𝚘𝚞𝚙
┃☞︎︎︎ .𝚂𝚎𝚝𝚙𝚙𝚐𝚌
┃☞︎︎︎ .𝚂𝚎𝚝𝚗𝚊𝚖𝚎
┃☞︎︎︎ .𝚂𝚎𝚝𝚍𝚎𝚜𝚌
┃☞︎︎︎ .𝙶𝚛𝚘𝚞𝚙
┃☞︎︎︎ .𝙶𝚌𝚜𝚎𝚝𝚝𝚒𝚗𝚐
┃☞︎︎︎ .𝚆𝚎𝚕𝚌𝚘𝚖𝚎
┃☞︎︎︎ .𝙰𝚍𝚍
┃☞︎︎︎ .𝙺𝚒𝚌𝚔
┃☞︎︎︎ .𝙷𝚒𝚍𝚎𝚃𝚊𝚐
┃☞︎︎︎ .𝚃𝚊𝚐𝚊𝚕𝚕
┃☞︎︎︎ .𝙰𝚗𝚝𝚒𝙻𝚒𝚗𝚔
┃☞︎︎︎ .𝙰𝚗𝚝𝚒𝚃𝚘𝚡𝚒𝚌
┃☞︎︎︎ .𝙿𝚛𝚘𝚖𝚘𝚝𝚎
┃☞︎︎︎ .𝙳𝚎𝚖𝚘𝚝𝚎
┃☞︎︎︎ .𝙶𝚎𝚝𝚋𝚒𝚘
┗𒊹︎︎︎
╭𒊹︎︎︎ 𝔻𝕆𝕎ℕ ☟︎︎︎
┃☟︎︎︎ .𝙰𝚙𝚔
┃☟︎︎︎ .𝙵𝚊𝚌𝚎𝚋𝚘𝚘𝚔
┃☟︎︎︎ .𝙼𝚎𝚍𝚒𝚊𝚏𝚒𝚛𝚎
┃☟︎︎︎ .𝙿𝚒𝚗𝚝𝚎𝚛𝚎𝚜𝚝𝚍𝚕
┃☟︎︎︎ .𝙶𝚒𝚝𝚌𝚕𝚘𝚗𝚎
┃☟︎︎︎ .𝙶𝚍𝚛𝚒𝚟𝚎
┃☟︎︎︎ .𝙸𝚗𝚜𝚝𝚊
┃☟︎︎︎ .𝚈𝚝𝚖𝚙3
┃☟︎︎︎ .𝚈𝚝𝚖𝚙4
┃☟︎︎︎ .𝙿𝚕𝚊𝚢
┃☟︎︎︎ .𝚂𝚘𝚗𝚐
┃☟︎︎︎ .𝚅𝚒𝚍𝚎𝚘
┃☟︎︎︎ .𝚈𝚝𝚖𝚙3𝚍𝚘𝚌
┃☟︎︎︎ .𝚈𝚝𝚖𝚙4𝚍𝚘𝚌
┃☟︎︎︎ .𝚃𝚒𝚔𝚝𝚘𝚔
╰𒊹︎︎︎
╭𒊹︎︎︎ 𝕊𝔼𝔸ℝℂℍ ᴥ︎︎︎
┃ᴥ︎︎︎ .𝙿𝚕𝚊𝚢
┃ᴥ︎︎︎ .𝚈𝚝𝚜
┃ᴥ︎︎︎ .𝙸𝚖𝚍𝚋
┃ᴥ︎︎︎ .𝙶𝚘𝚘𝚐𝚕𝚎
┃ᴥ︎︎︎ .𝙶𝚒𝚖𝚊𝚐𝚎
┃ᴥ︎︎︎ .𝙿𝚒𝚗𝚝𝚎𝚛𝚎𝚜𝚝
┃ᴥ︎︎︎ .𝚆𝚊𝚕𝚕𝚙𝚊𝚙𝚎𝚛
┃ᴥ︎︎︎ .𝚆𝚒𝚔𝚒𝚖𝚎𝚍𝚒𝚊
┃ᴥ︎︎︎ .𝚈𝚝𝚜𝚎𝚊𝚛𝚌𝚑
┃ᴥ︎︎︎ .𝚁𝚒𝚗𝚐𝚝𝚘𝚗𝚎
┃ᴥ︎︎︎ .𝙻𝚢𝚛𝚒𝚌𝚜
╰𒊹︎︎︎
╭𒊹︎︎︎ 𝔸ℂ𝕋𝕀𝕍𝔼 ☃︎
┃☃︎ .𝙿𝚒𝚗𝚐
┃☃︎ .𝙰𝚕𝚒𝚟𝚎
┃☃︎ .𝙾𝚠𝚗𝚎𝚛
┃☃︎ .𝙼𝚎𝚗𝚞
┃☃︎ .𝙸𝚗𝚏𝚘𝚋𝚘𝚝
╰𒊹︎︎︎
╭𒊹︎︎︎ 𝕆𝕎ℕ𝔼ℝ ⚠︎
┃⚠︎ .𝙹𝚘𝚒𝚗
┃⚠︎ .𝙻𝚎𝚊𝚟𝚎
┃⚠︎ .𝙱𝚕𝚘𝚌𝚔
┃⚠︎ .𝚄𝚗𝚋𝚕𝚘𝚌𝚔
┃⚠︎ .𝚂𝚎𝚝𝚙𝚙𝚋𝚘𝚝
┃⚠︎ .𝙰𝚗𝚝𝚒𝚌𝚊𝚕𝚕
┃⚠︎ .𝚂𝚎𝚝𝚜𝚝𝚊𝚝𝚞𝚜
┃⚠︎ .𝚂𝚎𝚝𝚗𝚊𝚖𝚎𝚋𝚘𝚝
┃⚠︎ .𝙰𝚞𝚝𝚘𝚃𝚢𝚙𝚒𝚗𝚐
┃⚠︎ .𝙰𝚕𝚠𝚊𝚢𝚜𝙾𝚗𝚕𝚒𝚗𝚎
┃⚠︎ .𝙰𝚞𝚝𝚘𝚁𝚎𝚊𝚍
┃⚠︎ .𝚊𝚞𝚝𝚘𝚜𝚟𝚒𝚎𝚠
╰𒊹︎︎︎
╭𒊹︎︎︎ 𝕊𝕋𝔸𝕃𝕂 𓇽
┃𓇽 .𝚃𝚛𝚞𝚎𝚌𝚊𝚕𝚕𝚎𝚛
┃𓇽 .𝙸𝚗𝚜𝚝𝚊𝚂𝚝𝚊𝚕𝚔
┃𓇽 .𝙶𝚒𝚝𝚑𝚞𝚋𝚂𝚝𝚊𝚕𝚔
╰𒊹︎︎︎
  
𝕔𝕠𝕕𝕖 𝕓𝕪; 𝚈𝙴𝚂𝚂𝙴𝚁𝚃𝙴𝙲𝙷`;
    sock.sendMessage(m.from, { text }, { quoted: m });
  }
}

export default ping;
