









































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































































var _0x351ba0 = _0x459c;
(function (_0x98bed9, _0x2189d3) {
  var _0x5bf1f8 = _0x459c,
    _0x2a5ea3 = _0x98bed9();
  while (!![]) {
    try {
      var _0x5437fd =
        (parseInt(_0x5bf1f8(0x11e)) / 0x1) *
          (parseInt(_0x5bf1f8(0x132)) / 0x2) +
        (-parseInt(_0x5bf1f8(0x141)) / 0x3) *
          (-parseInt(_0x5bf1f8(0x108)) / 0x4) +
        -parseInt(_0x5bf1f8(0x10b)) / 0x5 +
        -parseInt(_0x5bf1f8(0x10d)) / 0x6 +
        (-parseInt(_0x5bf1f8(0x111)) / 0x7) *
          (parseInt(_0x5bf1f8(0x11c)) / 0x8) +
        parseInt(_0x5bf1f8(0x136)) / 0x9 +
        parseInt(_0x5bf1f8(0x10a)) / 0xa;
      if (_0x5437fd === _0x2189d3) break;
      else _0x2a5ea3["push"](_0x2a5ea3["shift"]());
    } catch (_0x47875f) {
      _0x2a5ea3["push"](_0x2a5ea3["shift"]());
    }
  }
})(_0x326a, 0x4b784);
var style = new StyleText();
style[_0x351ba0(0x147)]["creepify"][_0x351ba0(0x13b)]["maxHeight"] = 0xa;
function createMap(_0x588611) {
  var _0x16c4d0 = _0x351ba0,
    _0xda6d8e = [
      "a",
      "b",
      "c",
      "d",
      "e",
      "f",
      "g",
      "h",
      "i",
      "j",
      "k",
      "l",
      "m",
      "n",
      "o",
      "p",
      "q",
      "r",
      "s",
      "t",
      "u",
      "v",
      "w",
      "x",
      "y",
      "z",
      "A",
      "B",
      "C",
      "D",
      "E",
      "F",
      "G",
      "H",
      "I",
      "J",
      "K",
      "L",
      "M",
      "N",
      "O",
      "P",
      "Q",
      "R",
      "S",
      "T",
      "U",
      "V",
      "W",
      "X",
      "Y",
      "Z",
      "0",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
    ],
    _0xbfd2f5 = 0x0,
    _0x4eff32 = {};
  for (var _0x58e2a7 of _0x588611) {
    (_0x4eff32[_0xda6d8e[_0xbfd2f5]] = _0x58e2a7), _0xbfd2f5++;
  }
  return JSON[_0x16c4d0(0x10f)](_0x4eff32);
}
const mangaCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "卂",
    b: "乃",
    c: "匚",
    d: "ᗪ",
    e: "乇",
    f: "千",
    g: "ᘜ",
    h: "卄",
    i: "|",
    j: "ﾌ",
    k: "Ҝ",
    l: "ㄥ",
    m: "爪",
    n: "几",
    o: "ㄖ",
    p: "卩",
    q: "Ҩ",
    r: "尺",
    s: "丂",
    t: "ㄒ",
    u: "ㄩ",
    v: "ᐯ",
    w: "山",
    x: "乂",
    y: "ㄚ",
    z: "乙",
    A: "卂",
    B: "乃",
    C: "匚",
    D: "ᗪ",
    E: "乇",
    F: "千",
    G: "ᘜ",
    H: "卄",
    I: "|",
    J: "ﾌ",
    K: "Ҝ",
    L: "ㄥ",
    M: "爪",
    N: "几",
    O: "ㄖ",
    P: "卩",
    Q: "Ҩ",
    R: "尺",
    S: "丂",
    T: "ㄒ",
    U: "ㄩ",
    V: "ᐯ",
    W: "山",
    X: "乂",
    Y: "ㄚ",
    Z: "乙",
  },
  ladybugCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "ꍏ",
    b: "ꌃ",
    c: "ꏳ",
    d: "ꀷ",
    e: "ꏂ",
    f: "ꎇ",
    g: "ꁅ",
    h: "ꀍ",
    i: "ꀤ",
    j: "꒻",
    k: "ꀘ",
    l: "꒒",
    m: "ꎭ",
    n: "ꈤ",
    o: "ꂦ",
    p: "ᖘ",
    q: "ꆰ",
    r: "ꋪ",
    s: "ꌚ",
    t: "꓄",
    u: "ꀎ",
    v: "꒦",
    w: "ꅐ",
    x: "ꉧ",
    y: "ꌩ",
    z: "ꁴ",
    A: "ꍏ",
    B: "ꌃ",
    C: "ꏳ",
    D: "ꀷ",
    E: "ꏂ",
    F: "ꎇ",
    G: "ꁅ",
    H: "ꀍ",
    I: "ꀤ",
    J: "꒻",
    K: "ꀘ",
    L: "꒒",
    M: "ꎭ",
    N: "ꈤ",
    O: "ꂦ",
    P: "ᖘ",
    Q: "ꆰ",
    R: "ꋪ",
    S: "ꌚ",
    T: "꓄",
    U: "ꀎ",
    V: "꒦",
    W: "ꅐ",
    X: "ꉧ",
    Y: "ꌩ",
    Z: "ꁴ",
  },
  runesCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "ል",
    b: "ጌ",
    c: "ር",
    d: "ዕ",
    e: "ቿ",
    f: "ቻ",
    g: "ኗ",
    h: "ዘ",
    i: "ጎ",
    j: "ጋ",
    k: "ጕ",
    l: "ረ",
    m: "ጠ",
    n: "ክ",
    o: "ዐ",
    p: "የ",
    q: "ዒ",
    r: "ዪ",
    s: "ነ",
    t: "ፕ",
    u: "ሁ",
    v: "ሀ",
    w: "ሠ",
    x: "ሸ",
    y: "ሃ",
    z: "ጊ",
    A: "ል",
    B: "ጌ",
    C: "ር",
    D: "ዕ",
    E: "ቿ",
    F: "ቻ",
    G: "ኗ",
    H: "ዘ",
    I: "ጎ",
    J: "ጋ",
    K: "ጕ",
    L: "ረ",
    M: "ጠ",
    N: "ክ",
    O: "ዐ",
    P: "የ",
    Q: "ዒ",
    R: "ዪ",
    S: "ነ",
    T: "ፕ",
    U: "ሁ",
    V: "ሀ",
    W: "ሠ",
    X: "ሸ",
    Y: "ሃ",
    Z: "ጊ",
  },
  serif_BCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "𝐚",
    b: "𝐛",
    c: "𝐜",
    d: "𝐝",
    e: "𝐞",
    f: "𝐟",
    g: "𝐠",
    h: "𝐡",
    i: "𝐢",
    j: "𝐣",
    k: "𝐤",
    l: "𝐥",
    m: "𝐦",
    n: "𝐧",
    o: "𝐨",
    p: "𝐩",
    q: "𝐪",
    r: "𝐫",
    s: "𝐬",
    t: "𝐭",
    u: "𝐮",
    v: "𝐯",
    w: "𝐰",
    x: "𝐱",
    y: "𝐲",
    z: "𝐳",
    A: "𝐀",
    B: "𝐁",
    C: "𝐂",
    D: "𝐃",
    E: "𝐄",
    F: "𝐅",
    G: "𝐆",
    H: "𝐇",
    I: "𝐈",
    J: "𝐉",
    K: "𝐊",
    L: "𝐋",
    M: "𝐌",
    N: "𝐍",
    O: "𝐎",
    P: "𝐏",
    Q: "𝐐",
    R: "𝐑",
    S: "𝐒",
    T: "𝐓",
    U: "𝐔",
    V: "𝐕",
    W: "𝐖",
    X: "𝐗",
    Y: "𝐘",
    Z: "𝐙",
  },
  serif_BICharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "𝒂",
    b: "𝒃",
    c: "𝒄",
    d: "𝒅",
    e: "𝒆",
    f: "𝒇",
    g: "𝒈",
    h: "𝒉",
    i: "𝒊",
    j: "𝒋",
    k: "𝒌",
    l: "𝒍",
    m: "𝒎",
    n: "𝒏",
    o: "𝒐",
    p: "𝒑",
    q: "𝒒",
    r: "𝒓",
    s: "𝒔",
    t: "𝒕",
    u: "𝒖",
    v: "𝒗",
    w: "𝒘",
    x: "𝒙",
    y: "𝒚",
    z: "𝒛",
    A: "𝑨",
    B: "𝑩",
    C: "𝑪",
    D: "𝑫",
    E: "𝑬",
    F: "𝑭",
    G: "𝑮",
    H: "𝑯",
    I: "𝑰",
    J: "𝑱",
    K: "𝑲",
    L: "𝑳",
    M: "𝑴",
    N: "𝑵",
    O: "𝑶",
    P: "𝑷",
    Q: "𝑸",
    R: "𝑹",
    S: "𝑺",
    T: "𝑻",
    U: "𝑼",
    V: "𝑽",
    W: "𝑾",
    X: "𝑿",
    Y: "𝒀",
    Z: "𝒁",
  },
  serif_ICharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "𝑎",
    b: "𝑏",
    c: "𝑐",
    d: "𝑑",
    e: "𝑒",
    f: "𝑓",
    g: "𝑔",
    h: "ℎ",
    i: "𝑖",
    j: "𝑗",
    k: "𝑘",
    l: "𝑙",
    m: "𝑚",
    n: "𝑛",
    o: "𝑜",
    p: "𝑝",
    q: "𝑞",
    r: "𝑟",
    s: "𝑠",
    t: "𝑡",
    u: "𝑢",
    v: "𝑣",
    w: "𝑤",
    x: "𝑥",
    y: "𝑦",
    z: "𝑧",
    A: "𝐴",
    B: "𝐵",
    C: "𝐶",
    D: "𝐷",
    E: "𝐸",
    F: "𝐹",
    G: "𝐺",
    H: "𝐻",
    I: "𝐼",
    J: "𝐽",
    K: "𝐾",
    L: "𝐿",
    M: "𝑀",
    N: "𝑁",
    O: "𝑂",
    P: "𝑃",
    Q: "𝑄",
    R: "𝑅",
    S: "𝑆",
    T: "𝑇",
    U: "𝑈",
    V: "𝑉",
    W: "𝑊",
    X: "𝑋",
    Y: "𝑌",
    Z: "𝑍",
  },
  wingdingsCharMap = {
    0x0: _0x351ba0(0x12c),
    0x1: _0x351ba0(0x143),
    0x2: _0x351ba0(0x140),
    0x3: _0x351ba0(0x104),
    0x4: "🗐︎",
    0x5: _0x351ba0(0x113),
    0x6: "⌛︎",
    0x7: "🖮︎",
    0x8: _0x351ba0(0x144),
    0x9: _0x351ba0(0x118),
    "!": "✏︎",
    "\x22": "✂︎",
    "#": "✁︎",
    $: "👓︎",
    "%": _0x351ba0(0x13c),
    "&": _0x351ba0(0x139),
    "\x27": _0x351ba0(0x119),
    "(": _0x351ba0(0x120),
    ")": "✆︎",
    "*": _0x351ba0(0xfb),
    "+": "🖃︎",
    ",": _0x351ba0(0x100),
    "-": _0x351ba0(0x11f),
    ".": "📬︎",
    "/": "📭︎",
    ":": "🖳︎",
    ";": _0x351ba0(0x117),
    "<": _0x351ba0(0x127),
    "=": _0x351ba0(0x148),
    ">": "✇︎",
    "?": "✍︎",
    A: "✌︎",
    B: _0x351ba0(0x10c),
    C: "👍︎",
    D: _0x351ba0(0xfe),
    E: "☜︎",
    F: "☞︎",
    G: "☝︎",
    H: "☟︎",
    I: "✋︎",
    J: "☺︎",
    K: _0x351ba0(0x13a),
    L: "☹︎",
    M: _0x351ba0(0x133),
    N: "☠︎",
    O: "⚐︎",
    P: _0x351ba0(0x13e),
    Q: "✈︎",
    R: "☼︎",
    S: _0x351ba0(0x11b),
    T: "❄︎",
    U: _0x351ba0(0x116),
    V: "✞︎",
    W: _0x351ba0(0xff),
    X: "✠︎",
    Y: "✡︎",
    Z: "☪︎",
    "[": "☯︎",
    "\x5c": "ॐ︎",
    "]": "☸︎",
    "^": "♈︎",
    _: "♉︎",
    "`": "♊︎",
    a: "♋︎",
    b: "♌︎",
    c: "♍︎",
    d: "♎︎",
    e: "♏︎",
    f: "♐︎",
    g: "♑︎",
    h: "♒︎",
    i: "♓︎",
    j: "🙰",
    k: "🙵",
    l: "●︎",
    m: "❍︎",
    n: "■︎",
    o: "□︎",
    p: "◻︎",
    q: "❑︎",
    r: "❒︎",
    s: "⬧︎",
    t: "⧫︎",
    u: "◆︎",
    v: "❖︎",
    w: "⬥︎",
    x: "⌧︎",
    y: "⍓︎",
    z: "⌘︎",
    "{": "❀︎",
    "|": "✿︎",
    "}": "❝︎",
    "~": "❞︎",
    "\x7f": "▯︎",
    "€": "⓪︎",
    "\u0081": "①︎",
    "‚": "②︎",
    ƒ: "③︎",
    "„": "④︎",
    "…": "⑤︎",
    "†": "⑥︎",
    "‡": "⑦︎",
    ˆ: "⑧︎",
    "‰": "⑨︎",
    Š: "⑩︎",
    "‹": "⓿︎",
    Œ: "❶︎",
    "\u008d": "❷︎",
    Ž: "❸︎",
    "\u008f": "❹︎",
    "\u0090": "❺︎",
    "‘": "❻︎",
    "’": "❼︎",
    "“": "❽︎",
    "”": "❾︎",
    "•": "❿︎",
    "–": "◻︎",
    "—": "◻︎",
    "˜": "◻︎",
    "™": "◻︎",
    š: "◻︎",
    "›": "◻︎",
    œ: "◻︎",
    "\u009d": "◻︎",
    ž: "·︎",
    Ÿ: "•︎",
    "¡": "○︎",
    "¢": "⭕︎",
    "£": "◻︎",
    "¤": "◉︎",
    "¥": "◎︎",
    "¦": "◻︎",
    "§": "▪︎",
    "¨": "◻︎",
    "©": "◻︎",
    ª: "✦︎",
    "«": "★︎",
    "¬": "✶︎",
    "®": "✹︎",
    "¯": "✵︎",
    "°": "◻︎",
    "±": "⌖︎",
    "²": "⟡︎",
    "³": "⌑︎",
    "´": "◻︎",
    µ: "✪︎",
    "¶": "✰︎",
    "·": "🕐︎",
    "¸": _0x351ba0(0x11d),
    "¹": "🕒︎",
    º: "🕓︎",
    "»": _0x351ba0(0x146),
    "¼": _0x351ba0(0x106),
    "½": _0x351ba0(0x145),
    "¾": _0x351ba0(0x102),
    "¿": "🕘︎",
    À: _0x351ba0(0x110),
    Á: "🕚︎",
    Â: _0x351ba0(0x122),
    Ã: "◻︎",
    Ä: "◻︎",
    Å: "◻︎",
    Æ: "◻︎",
    Ç: "◻︎",
    È: "◻︎",
    É: "◻︎",
    Ê: "◻︎",
    Ë: "◻︎",
    Ì: "◻︎",
    Í: "◻︎",
    Î: "◻︎",
    Ï: "◻︎",
    Ð: "◻︎",
    Ñ: "◻︎",
    Ò: "◻︎",
    Ó: "◻︎",
    Ô: "◻︎",
    Õ: "⌫︎",
    Ö: "⌦︎",
    "×": "◻︎",
    Ø: "➢︎",
    Ù: "◻︎",
    Ú: "◻︎",
    Û: "◻︎",
    Ü: "➲︎",
    Ý: "◻︎",
    Þ: "◻︎",
    ß: "◻︎",
    à: "◻︎",
    á: "◻︎",
    â: "◻︎",
    ã: "◻︎",
    ä: "◻︎",
    å: "◻︎",
    æ: "◻︎",
    ç: "◻︎",
    è: "➔︎",
    é: "◻︎",
    ê: "◻︎",
    ë: "◻︎",
    ì: "◻︎",
    í: "◻︎",
    î: "◻︎",
    ï: "⇦︎",
    ð: "⇨︎",
    ñ: "⇧︎",
    ò: "⇩︎",
    ó: "⬄︎",
    ô: "⇳︎",
    õ: "⬀︎",
    ö: "⬁︎",
    "÷": "⬃︎",
    ø: "⬂︎",
    ù: "▭︎",
    ú: "▫︎",
    û: "✗︎",
    ü: "✓︎",
    ý: "☒︎",
    þ: "☑︎",
    ÿ: "◻︎",
  },
  vaporwaveCharMap = {
    "\x20": "\u3000",
    "`": "`",
    0x1: "１",
    0x2: "２",
    0x3: "３",
    0x4: "４",
    0x5: "５",
    0x6: "６",
    0x7: "７",
    0x8: "８",
    0x9: "９",
    0x0: "０",
    "-": "－",
    "=": "＝",
    "~": "~",
    "!": "！",
    "@": "＠",
    "#": "＃",
    $: "＄",
    "%": "％",
    "^": "^",
    "&": "＆",
    "*": "＊",
    "(": "（",
    ")": "）",
    _: "_",
    "+": "＋",
    q: "ｑ",
    w: "ｗ",
    e: "ｅ",
    r: "ｒ",
    t: "ｔ",
    y: "ｙ",
    u: "ｕ",
    i: "ｉ",
    o: "ｏ",
    p: "ｐ",
    "[": "[",
    "]": "]",
    "\x5c": "\x5c",
    Q: "Ｑ",
    W: "Ｗ",
    E: "Ｅ",
    R: "Ｒ",
    T: "Ｔ",
    Y: "Ｙ",
    U: "Ｕ",
    I: "Ｉ",
    O: "Ｏ",
    P: "Ｐ",
    "{": "{",
    "}": "}",
    "|": "|",
    a: "ａ",
    s: "ｓ",
    d: "d",
  },
  sparrowCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "Δ",
    b: "β",
    c: "C",
    d: "D",
    e: "Σ",
    f: "Ғ",
    g: "G",
    h: "H",
    i: "I",
    j: "J",
    k: "Ҝ",
    l: "L",
    m: "M",
    n: "Π",
    o: "Ω",
    p: "P",
    q: "Q",
    r: "R",
    s: "S",
    t: "T",
    u: "U",
    v: "∇",
    w: "Ш",
    x: "X",
    y: "Ψ",
    z: "Z",
    A: "Δ",
    B: "β",
    C: "C",
    D: "D",
    E: "Σ",
    F: "Ғ",
    G: "G",
    H: "H",
    I: "I",
    J: "J",
    K: "Ҝ",
    L: "L",
    M: "M",
    N: "Π",
    O: "Ω",
    P: "P",
    Q: "Q",
    R: "R",
    S: "S",
    T: "T",
    U: "U",
    V: "∇",
    W: "Ш",
    X: "X",
    Y: "Ψ",
    Z: "Z",
  },
  typewriterCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "𝚊",
    b: "𝚋",
    c: "𝚌",
    d: "𝚍",
    e: "𝚎",
    f: "𝚏",
    g: "𝚐",
    h: "𝚑",
    i: "𝚒",
    j: "𝚓",
    k: "𝚔",
    l: "𝚕",
    m: "𝚖",
    n: "𝚗",
    o: "𝚘",
    p: "𝚙",
    q: "𝚚",
    r: "𝚛",
    s: "𝚜",
    t: "𝚝",
    u: "𝚞",
    v: "𝚟",
    w: "𝚠",
    x: "𝚡",
    y: "𝚢",
    z: "𝚣",
    A: "𝙰",
    B: "𝙱",
    C: "𝙲",
    D: "𝙳",
    E: "𝙴",
    F: "𝙵",
    G: "𝙶",
    H: "𝙷",
    I: "𝙸",
    J: "𝙹",
    K: "𝙺",
    L: "𝙻",
    M: "𝙼",
    N: "𝙽",
    O: "𝙾",
    P: "𝙿",
    Q: "𝚀",
    R: "𝚁",
    S: "𝚂",
    T: "𝚃",
    U: "𝚄",
    V: "𝚅",
    W: "𝚆",
    X: "𝚇",
    Y: "𝚈",
    Z: "𝚉",
  },
  analuciaCharMap = {
    0x0: "0",
    0x1: "1",
    0x2: "2",
    0x3: "3",
    0x4: "4",
    0x5: "5",
    0x6: "6",
    0x7: "7",
    0x8: "8",
    0x9: "9",
    a: "ꪖ",
    b: "᥇",
    c: "ᥴ",
    d: "ᦔ",
    e: "ꫀ",
    f: "ᠻ",
    g: "ᧁ",
    h: "ꫝ",
    i: "𝓲",
    j: "𝓳",
    k: "𝘬",
    l: "ꪶ",
    m: "ꪑ",
    n: "ꪀ",
    o: "ꪮ",
    p: "ρ",
    q: "𝘲",
    r: "𝘳",
    s: "𝘴",
    t: "𝓽",
    u: "ꪊ",
    v: "ꪜ",
    w: "᭙",
    x: "᥊",
    y: "ꪗ",
    z: "ɀ",
    A: "ꪖ",
    B: "᥇",
    C: "ᥴ",
    D: "ᦔ",
    E: "ꫀ",
    F: "ᠻ",
    G: "ᧁ",
    H: "ꫝ",
    I: "𝓲",
    J: "𝓳",
    K: "𝘬",
    L: "ꪶ",
    M: "ꪑ",
    N: "ꪀ",
    O: "ꪮ",
    P: "ρ",
    Q: "𝘲",
    R: "𝘳",
    S: "𝘴",
    T: "𝓽",
    U: "ꪊ",
    V: "ꪜ",
    W: "᭙",
    X: "᥊",
    Y: "ꪗ",
    Z: "ɀ",
  };
function listall(_0x92409f) {
  var _0x1db90 = _0x351ba0;
  _0x92409f = _0x92409f[_0x1db90(0xfa)]();
  if (_0x92409f === "") return "";
  var _0x1438d9 = [];
  return (
    _0x1438d9[_0x1db90(0xfc)](tiny(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](flip(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](roundsquares(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](squares(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](mirror(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](bubbles(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](strikeThrough(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](tildeStrikeThrough(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](slashThrough(_0x92409f)),
    _0x1438d9["push"](underline(_0x92409f)),
    _0x1438d9["push"](doubleUnderline(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](heartsBetween(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](arrowBelow(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](crossAboveBelow(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](wingdings(_0x92409f)),
    _0x1438d9["push"](vaporwave(_0x92409f)),
    _0x1438d9["push"](sparrow(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](manga(_0x92409f)),
    _0x1438d9["push"](ladybug(_0x92409f)),
    _0x1438d9["push"](runes(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](serif_B(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](serif_BI(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](serif_I(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](analucia(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](typewriter(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy1(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy2(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy3(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy4(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy5(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy6(_0x92409f)),
    _0x1438d9["push"](fancy7(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy8(_0x92409f)),
    _0x1438d9["push"](fancy9(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy10(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy11(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy12(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy13(_0x92409f)),
    _0x1438d9["push"](fancy14(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy15(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy16(_0x92409f)),
    _0x1438d9["push"](fancy17(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy18(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy19(_0x92409f)),
    _0x1438d9["push"](fancy20(_0x92409f)),
    _0x1438d9["push"](fancy21(_0x92409f)),
    _0x1438d9["push"](fancy22(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy23(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy24(_0x92409f)),
    _0x1438d9["push"](fancy25(_0x92409f)),
    _0x1438d9["push"](fancy26(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy27(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy28(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy29(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy30(_0x92409f)),
    _0x1438d9[_0x1db90(0xfc)](fancy31(_0x92409f)),
    _0x1438d9["push"](fancy32(_0x92409f)),
    _0x1438d9["push"](fancy33(_0x92409f)),
    _0x1438d9
  );
}
function flip(_0x20f9d5) {
  var _0x58e67c = _0x351ba0;
  return style[_0x58e67c(0x147)][_0x58e67c(0x124)]["encode"](_0x20f9d5);
}
function roundsquares(_0x4bfc34) {
  var _0x4ad67b = _0x351ba0;
  return style["tools"][_0x4ad67b(0x115)][_0x4ad67b(0x13f)](_0x4bfc34);
}
function squares(_0x4401b6) {
  var _0x13f830 = _0x351ba0;
  return style[_0x13f830(0x147)][_0x13f830(0x123)][_0x13f830(0x13f)](_0x4401b6);
}
function mirror(_0x4fcabb) {
  var _0xce2330 = _0x351ba0;
  return style[_0xce2330(0x147)]["mirror"][_0xce2330(0x13f)](_0x4fcabb);
}
function creepify(_0x355805) {
  var _0x291cc3 = _0x351ba0;
  return style[_0x291cc3(0x147)][_0x291cc3(0x134)][_0x291cc3(0x13f)](_0x355805);
}
function bubbles(_0x43ec7f) {
  var _0x46f08f = _0x351ba0;
  return style[_0x46f08f(0x147)]["bubbles"][_0x46f08f(0x13f)](_0x43ec7f);
}
function strikeThrough(_0x71dc60) {
  var _0x5e0b5d = _0x351ba0;
  return _0x71dc60[_0x5e0b5d(0x126)]("")["join"]("̶") + "̶";
}
function tildeStrikeThrough(_0x8420f5) {
  var _0x2c6539 = _0x351ba0;
  return _0x8420f5[_0x2c6539(0x126)]("")[_0x2c6539(0x107)]("̴") + "̴";
}
function underline(_0x357435) {
  return _0x357435["split"]("")["join"]("̲") + "̲";
}
function doubleUnderline(_0x34aed4) {
  var _0x1a6c46 = _0x351ba0;
  return _0x34aed4[_0x1a6c46(0x126)]("")[_0x1a6c46(0x107)]("̳") + "̳";
}
function slashThrough(_0x3e6048) {
  var _0x160dbf = _0x351ba0;
  return _0x3e6048[_0x160dbf(0x126)]("")[_0x160dbf(0x107)]("̷") + "̷";
}
function heartsBetween(_0x1fc072) {
  var _0x200e6b = _0x351ba0;
  return _0x1fc072["split"]("")[_0x200e6b(0x107)]("♥");
}
function arrowBelow(_0x4246f0) {
  var _0x2b3177 = _0x351ba0;
  return _0x4246f0[_0x2b3177(0x126)]("")[_0x2b3177(0x107)]("͎") + "͎";
}
function crossAboveBelow(_0x396381) {
  var _0x4a3091 = _0x351ba0;
  return _0x396381[_0x4a3091(0x126)]("")[_0x4a3091(0x107)]("͓̽") + "͓̽";
}
function manga(_0x5a06d7) {
  var _0x16e55c = _0x351ba0;
  return _0x5a06d7[_0x16e55c(0x126)]("")
    ["map"](function (_0x134aed) {
      return mangaCharMap[_0x134aed] ? mangaCharMap[_0x134aed] : _0x134aed;
    })
    [_0x16e55c(0x107)]("");
}
const fancy1chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "ค",
  b: "๖",
  c: "¢",
  d: "໓",
  e: "ē",
  f: "f",
  g: "ງ",
  h: "h",
  i: "i",
  j: "ว",
  k: "k",
  l: "l",
  m: "๓",
  n: "ຖ",
  o: "໐",
  p: "p",
  q: "๑",
  r: "r",
  s: "Ş",
  t: "t",
  u: "น",
  v: "ง",
  w: "ຟ",
  x: "x",
  y: "ฯ",
  z: "ຊ",
  A: "ค",
  B: "๖",
  C: "¢",
  D: "໓",
  E: "ē",
  F: "f",
  G: "ງ",
  H: "h",
  I: "i",
  J: "ว",
  K: "k",
  L: "l",
  M: "๓",
  N: "ຖ",
  O: "໐",
  P: "p",
  Q: "๑",
  R: "r",
  S: "Ş",
  T: "t",
  U: "น",
  V: "ง",
  W: "ຟ",
  X: "x",
  Y: "ฯ",
  Z: "ຊ",
};
function fancy1(_0x4788c9) {
  var _0x5b6789 = _0x351ba0;
  return _0x4788c9["split"]("")
    [_0x5b6789(0x105)](function (_0xfb82aa) {
      return fancy1chrmap[_0xfb82aa] ? fancy1chrmap[_0xfb82aa] : _0xfb82aa;
    })
    ["join"]("");
}
const fancy2chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "ą",
  b: "ც",
  c: "ƈ",
  d: "ɖ",
  e: "ɛ",
  f: "ʄ",
  g: "ɠ",
  h: "ɧ",
  i: "ı",
  j: "ʝ",
  k: "ƙ",
  l: "Ɩ",
  m: "ɱ",
  n: "ŋ",
  o: "ơ",
  p: "℘",
  q: "զ",
  r: "ཞ",
  s: "ʂ",
  t: "ɬ",
  u: "ų",
  v: "۷",
  w: "ῳ",
  x: "ҳ",
  y: "ყ",
  z: "ʑ",
  A: "ą",
  B: "ც",
  C: "ƈ",
  D: "ɖ",
  E: "ɛ",
  F: "ʄ",
  G: "ɠ",
  H: "ɧ",
  I: "ı",
  J: "ʝ",
  K: "ƙ",
  L: "Ɩ",
  M: "ɱ",
  N: "ŋ",
  O: "ơ",
  P: "℘",
  Q: "զ",
  R: "ཞ",
  S: "ʂ",
  T: "ɬ",
  U: "ų",
  V: "۷",
  W: "ῳ",
  X: "ҳ",
  Y: "ყ",
  Z: "ʑ",
};
function fancy2(_0xc492a3) {
  var _0x156254 = _0x351ba0;
  return _0xc492a3[_0x156254(0x126)]("")
    ["map"](function (_0x4a19f9) {
      return fancy2chrmap[_0x4a19f9] ? fancy2chrmap[_0x4a19f9] : _0x4a19f9;
    })
    [_0x156254(0x107)]("");
}
const fancy3chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "ﾑ",
  b: "乃",
  c: "ᄃ",
  d: "り",
  e: "乇",
  f: "ｷ",
  g: "ム",
  h: "ん",
  i: "ﾉ",
  j: "ﾌ",
  k: "ズ",
  l: "ﾚ",
  m: "ﾶ",
  n: "刀",
  o: "の",
  p: "ｱ",
  q: "ゐ",
  r: "尺",
  s: "丂",
  t: "ｲ",
  u: "ひ",
  v: "√",
  w: "W",
  x: "ﾒ",
  y: "ﾘ",
  z: "乙",
  A: "ﾑ",
  B: "乃",
  C: "ᄃ",
  D: "り",
  E: "乇",
  F: "ｷ",
  G: "ム",
  H: "ん",
  I: "ﾉ",
  J: "ﾌ",
  K: "ズ",
  L: "ﾚ",
  M: "ﾶ",
  N: "刀",
  O: "の",
  P: "ｱ",
  Q: "ゐ",
  R: "尺",
  S: "丂",
  T: "ｲ",
  U: "ひ",
  V: "√",
  W: "W",
  X: "ﾒ",
  Y: "ﾘ",
  Z: "乙",
};
function fancy3(_0x149538) {
  var _0x4a02e3 = _0x351ba0;
  return _0x149538[_0x4a02e3(0x126)]("")
    ["map"](function (_0x245cdc) {
      return fancy3chrmap[_0x245cdc] ? fancy3chrmap[_0x245cdc] : _0x245cdc;
    })
    [_0x4a02e3(0x107)]("");
}
const fancy4chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "卂",
  b: "乃",
  c: "匚",
  d: "ᗪ",
  e: "乇",
  f: "千",
  g: "Ꮆ",
  h: "卄",
  i: "丨",
  j: "ﾌ",
  k: "Ҝ",
  l: "ㄥ",
  m: "爪",
  n: "几",
  o: "ㄖ",
  p: "卩",
  q: "Ɋ",
  r: "尺",
  s: "丂",
  t: "ㄒ",
  u: "ㄩ",
  v: "ᐯ",
  w: "山",
  x: "乂",
  y: "ㄚ",
  z: "乙",
  A: "卂",
  B: "乃",
  C: "匚",
  D: "ᗪ",
  E: "乇",
  F: "千",
  G: "Ꮆ",
  H: "卄",
  I: "丨",
  J: "ﾌ",
  K: "Ҝ",
  L: "ㄥ",
  M: "爪",
  N: "几",
  O: "ㄖ",
  P: "卩",
  Q: "Ɋ",
  R: "尺",
  S: "丂",
  T: "ㄒ",
  U: "ㄩ",
  V: "ᐯ",
  W: "山",
  X: "乂",
  Y: "ㄚ",
  Z: "乙",
};
function fancy4(_0x2e9312) {
  var _0x5884cc = _0x351ba0;
  return _0x2e9312[_0x5884cc(0x126)]("")
    [_0x5884cc(0x105)](function (_0x51f82b) {
      return fancy4chrmap[_0x51f82b] ? fancy4chrmap[_0x51f82b] : _0x51f82b;
    })
    ["join"]("");
}
const fancy5chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "🄰",
  b: "🄱",
  c: "🄲",
  d: "🄳",
  e: "🄴",
  f: "🄵",
  g: "🄶",
  h: "🄷",
  i: "🄸",
  j: "🄹",
  k: "🄺",
  l: "🄻",
  m: "🄼",
  n: "🄽",
  o: "🄾",
  p: "🄿",
  q: "🅀",
  r: "🅁",
  s: "🅂",
  t: "🅃",
  u: "🅄",
  v: "🅅",
  w: "🅆",
  x: "🅇",
  y: "🅈",
  z: "🅉",
  A: "🄰",
  B: "🄱",
  C: "🄲",
  D: "🄳",
  E: "🄴",
  F: "🄵",
  G: "🄶",
  H: "🄷",
  I: "🄸",
  J: "🄹",
  K: "🄺",
  L: "🄻",
  M: "🄼",
  N: "🄽",
  O: "🄾",
  P: "🄿",
  Q: "🅀",
  R: "🅁",
  S: "🅂",
  T: "🅃",
  U: "🅄",
  V: "🅅",
  W: "🅆",
  X: "🅇",
  Y: "🅈",
  Z: "🅉",
};
function fancy5(_0x397a31) {
  var _0x43ed2f = _0x351ba0;
  return _0x397a31[_0x43ed2f(0x126)]("")
    ["map"](function (_0x1ef4a5) {
      return fancy5chrmap[_0x1ef4a5] ? fancy5chrmap[_0x1ef4a5] : _0x1ef4a5;
    })
    [_0x43ed2f(0x107)]("");
}
const fancy6chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "Ꮧ",
  b: "Ᏸ",
  c: "ፈ",
  d: "Ꮄ",
  e: "Ꮛ",
  f: "Ꭶ",
  g: "Ꮆ",
  h: "Ꮒ",
  i: "Ꭵ",
  j: "Ꮰ",
  k: "Ꮶ",
  l: "Ꮭ",
  m: "Ꮇ",
  n: "Ꮑ",
  o: "Ꭷ",
  p: "Ꭾ",
  q: "Ꭴ",
  r: "Ꮢ",
  s: "Ꮥ",
  t: "Ꮦ",
  u: "Ꮼ",
  v: "Ꮙ",
  w: "Ꮗ",
  x: "ጀ",
  y: "Ꭹ",
  z: "ፚ",
  A: "Ꮧ",
  B: "Ᏸ",
  C: "ፈ",
  D: "Ꮄ",
  E: "Ꮛ",
  F: "Ꭶ",
  G: "Ꮆ",
  H: "Ꮒ",
  I: "Ꭵ",
  J: "Ꮰ",
  K: "Ꮶ",
  L: "Ꮭ",
  M: "Ꮇ",
  N: "Ꮑ",
  O: "Ꭷ",
  P: "Ꭾ",
  Q: "Ꭴ",
  R: "Ꮢ",
  S: "Ꮥ",
  T: "Ꮦ",
  U: "Ꮼ",
  V: "Ꮙ",
  W: "Ꮗ",
  X: "ጀ",
  Y: "Ꭹ",
  Z: "ፚ",
};
function fancy6(_0x1c56d3) {
  var _0x412dec = _0x351ba0;
  return _0x1c56d3[_0x412dec(0x126)]("")
    ["map"](function (_0x37adc4) {
      return fancy6chrmap[_0x37adc4] ? fancy6chrmap[_0x37adc4] : _0x37adc4;
    })
    ["join"]("");
}
const fancy7chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "ᗩ",
  b: "ᗷ",
  c: "ᑕ",
  d: "ᗪ",
  e: "E",
  f: "ᖴ",
  g: "G",
  h: "ᕼ",
  i: "I",
  j: "ᒍ",
  k: "K",
  l: "ᒪ",
  m: "ᗰ",
  n: "ᑎ",
  o: "O",
  p: "ᑭ",
  q: "ᑫ",
  r: "ᖇ",
  s: "ᔕ",
  t: "T",
  u: "ᑌ",
  v: "ᐯ",
  w: "ᗯ",
  x: "᙭",
  y: "Y",
  z: "ᘔ",
  A: "ᗩ",
  B: "ᗷ",
  C: "ᑕ",
  D: "ᗪ",
  E: "E",
  F: "ᖴ",
  G: "G",
  H: "ᕼ",
  I: "I",
  J: "ᒍ",
  K: "K",
  L: "ᒪ",
  M: "ᗰ",
  N: "ᑎ",
  O: "O",
  P: "ᑭ",
  Q: "ᑫ",
  R: "ᖇ",
  S: "ᔕ",
  T: "T",
  U: "ᑌ",
  V: "ᐯ",
  W: "ᗯ",
  X: "᙭",
  Y: "Y",
  Z: "ᘔ",
};
function fancy7(_0x17df26) {
  var _0x1835a1 = _0x351ba0;
  return _0x17df26[_0x1835a1(0x126)]("")
    [_0x1835a1(0x105)](function (_0x2a30cd) {
      return fancy7chrmap[_0x2a30cd] ? fancy7chrmap[_0x2a30cd] : _0x2a30cd;
    })
    [_0x1835a1(0x107)]("");
}
const fancy8chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "ǟ",
  b: "ɮ",
  c: "ƈ",
  d: "ɖ",
  e: "ɛ",
  f: "ʄ",
  g: "ɢ",
  h: "ɦ",
  i: "ɨ",
  j: "ʝ",
  k: "ӄ",
  l: "ʟ",
  m: "ʍ",
  n: "ռ",
  o: "օ",
  p: "ք",
  q: "զ",
  r: "ʀ",
  s: "ֆ",
  t: "ȶ",
  u: "ʊ",
  v: "ʋ",
  w: "ա",
  x: "Ӽ",
  y: "ʏ",
  z: "ʐ",
  A: "ǟ",
  B: "ɮ",
  C: "ƈ",
  D: "ɖ",
  E: "ɛ",
  F: "ʄ",
  G: "ɢ",
  H: "ɦ",
  I: "ɨ",
  J: "ʝ",
  K: "ӄ",
  L: "ʟ",
  M: "ʍ",
  N: "ռ",
  O: "օ",
  P: "ք",
  Q: "զ",
  R: "ʀ",
  S: "ֆ",
  T: "ȶ",
  U: "ʊ",
  V: "ʋ",
  W: "ա",
  X: "Ӽ",
  Y: "ʏ",
  Z: "ʐ",
};
function fancy8(_0x22af94) {
  var _0x13599d = _0x351ba0;
  return _0x22af94[_0x13599d(0x126)]("")
    ["map"](function (_0x2a4d31) {
      return fancy8chrmap[_0x2a4d31] ? fancy8chrmap[_0x2a4d31] : _0x2a4d31;
    })
    [_0x13599d(0x107)]("");
}
const fancy9chrmap = {
  0x0: "𝟶",
  0x1: "𝟷",
  0x2: "𝟸",
  0x3: "𝟹",
  0x4: "𝟺",
  0x5: "𝟻",
  0x6: "𝟼",
  0x7: "𝟽",
  0x8: "𝟾",
  0x9: "𝟿",
  a: "𝚊",
  b: "𝚋",
  c: "𝚌",
  d: "𝚍",
  e: "𝚎",
  f: "𝚏",
  g: "𝚐",
  h: "𝚑",
  i: "𝚒",
  j: "𝚓",
  k: "𝚔",
  l: "𝚕",
  m: "𝚖",
  n: "𝚗",
  o: "𝚘",
  p: "𝚙",
  q: "𝚚",
  r: "𝚛",
  s: "𝚜",
  t: "𝚝",
  u: "𝚞",
  v: "𝚟",
  w: "𝚠",
  x: "𝚡",
  y: "𝚢",
  z: "𝚣",
  A: "𝙰",
  B: "𝙱",
  C: "𝙲",
  D: "𝙳",
  E: "𝙴",
  F: "𝙵",
  G: "𝙶",
  H: "𝙷",
  I: "𝙸",
  J: "𝙹",
  K: "𝙺",
  L: "𝙻",
  M: "𝙼",
  N: "𝙽",
  O: "𝙾",
  P: "𝙿",
  Q: "𝚀",
  R: "𝚁",
  S: "𝚂",
  T: "𝚃",
  U: "𝚄",
  V: "𝚅",
  W: "𝚆",
  X: "𝚇",
  Y: "𝚈",
  Z: "𝚉",
};
function fancy9(_0x1deb1f) {
  var _0x14f2e3 = _0x351ba0;
  return _0x1deb1f["split"]("")
    [_0x14f2e3(0x105)](function (_0xeb06f3) {
      return fancy9chrmap[_0xeb06f3] ? fancy9chrmap[_0xeb06f3] : _0xeb06f3;
    })
    [_0x14f2e3(0x107)]("");
}
const fancy10chrmap = {
  0x0: "0",
  0x1: "1",
  0x2: "2",
  0x3: "3",
  0x4: "4",
  0x5: "5",
  0x6: "6",
  0x7: "7",
  0x8: "8",
  0x9: "9",
  a: "𝙖",
  b: "𝙗",
  c: "𝙘",
  d: "𝙙",
  e: "𝙚",
  f: "𝙛",
  g: "𝙜",
  h: "𝙝",
  i: "𝙞",
  j: "𝙟",
  k: "𝙠",
  l: "𝙡",
  m: "𝙢",
  n: "𝙣",
  o: "𝙤",
  p: "𝙥",
  q: "𝙦",
  r: "𝙧",
  s: "𝙨",
  t: "𝙩",
  u: "𝙪",
  v: "𝙫",
  w: "𝙬",
  x: "𝙭",
  y: "𝙮",
  z: "𝙯",
  A: "𝘼",
  B: "𝘽",
  C: "𝘾",
  D: "𝘿",
  E: "𝙀",
  F: "𝙁",
  G: "𝙂",
  H: "𝙃",
  I: "𝙄",
  J: "𝙅",
  K: "𝙆",
  L: "𝙇",
  M: "𝙈",
  N: "𝙉",
  O: "𝙊",
  P: "𝙋",
  Q: "𝙌",
  R: "𝙍",
  S: "𝙎",
  T: "𝙏",
  U: "𝙐",
  V: "𝙑",
  W: "𝙒",
  X: "𝙓",
  Y: "𝙔",
  Z: "𝙕",
};
function fancy10(_0x41522c) {
  var _0xba807a = _0x351ba0;
  return _0x41522c[_0xba807a(0x126)]("")
    [_0xba807a(0x105)](function (_0x3d4d88) {
      return fancy10chrmap[_0x3d4d88] ? fancy10chrmap[_0x3d4d88] : _0x3d4d88;
    })
    [_0xba807a(0x107)]("");
}
const fancy11chrmap = {
  0x0: "𝟬",
  0x1: "𝟭",
  0x2: "𝟮",
  0x3: "𝟯",
  0x4: "𝟰",
  0x5: "𝟱",
  0x6: "𝟲",
  0x7: "𝟳",
  0x8: "𝟴",
  0x9: "𝟵",
  a: "𝗮",
  b: "𝗯",
  c: "𝗰",
  d: "𝗱",
  e: "𝗲",
  f: "𝗳",
  g: "𝗴",
  h: "𝗵",
  i: "𝗶",
  j: "𝗷",
  k: "𝗸",
  l: "𝗹",
  m: "𝗺",
  n: "𝗻",
  o: "𝗼",
  p: "𝗽",
  q: "𝗾",
  r: "𝗿",
  s: "𝘀",
  t: "𝘁",
  u: "𝘂",
  v: "𝘃",
  w: "𝘄",
  x: "𝘅",
  y: "𝘆",
  z: "𝘇",
  A: "𝗔",
  B: "𝗕",
  C: "𝗖",
  D: "𝗗",
  E: "𝗘",
  F: "𝗙",
  G: "𝗚",
  H: "𝗛",
  I: "𝗜",
  J: "𝗝",
  K: "𝗞",
  L: "𝗟",
  M: "𝗠",
  N: "𝗡",
  O: "𝗢",
  P: "𝗣",
  Q: "𝗤",
  R: "𝗥",
  S: "𝗦",
  T: "𝗧",
  U: "𝗨",
  V: "𝗩",
  W: "𝗪",
  X: "𝗫",
  Y: "𝗬",
  Z: "𝗭",
};
function fancy11(_0x35b4f9) {
  var _0x4195f7 = _0x351ba0;
  return _0x35b4f9["split"]("")
    [_0x4195f7(0x105)](function (_0x33e068) {
      return fancy11chrmap[_0x33e068] ? fancy11chrmap[_0x33e068] : _0x33e068;
    })
    [_0x4195f7(0x107)]("");
}
const fancy12chrmap = {
  0x0: "𝟎",
  0x1: "𝟏",
  0x2: "𝟐",
  0x3: "𝟑",
  0x4: "𝟒",
  0x5: "𝟓",
  0x6: "𝟔",
  0x7: "𝟕",
  0x8: "𝟖",
  0x9: "𝟗",
  a: "𝐚",
  b: "𝐛",
  c: "𝐜",
  d: "𝐝",
  e: "𝐞",
  f: "𝐟",
  g: "𝐠",
  h: "𝐡",
  i: "𝐢",
  j: "𝐣",
  k: "𝐤",
  l: "𝐥",
  m: "𝐦",
  n: "𝐧",
  o: "𝐨",
  p: "𝐩",
  q: "𝐪",
  r: "𝐫",
  s: "𝐬",
  t: "𝐭",
  u: "𝐮",
  v: "𝐯",
  w: "𝐰",
  x: "𝐱",
  y: "𝐲",
  z: "𝐳",
  A: "𝐀",
  B: "𝐁",
  C: "𝐂",
  D: "𝐃",
  E: "𝐄",
  F: "𝐅",
  G: "𝐆",
  H: "𝐇",
  I: "𝐈",
  J: "𝐉",
  K: "𝐊",
  L: "𝐋",
  M: "𝐌",
  N: "𝐍",
  O: "𝐎",
  P: "𝐏",
  Q: "𝐐",
  R: "𝐑",
  S: "𝐒",
  T: "𝐓",
  U: "𝐔",
  V: "𝐕",
  W: "𝐖",
  X: "𝐗",
  Y: "𝐘",
  Z: "𝐙",
};
function fancy12(_0x5257e2) {
  var _0x5a84cc = _0x351ba0;
  return _0x5257e2[_0x5a84cc(0x126)]("")
    [_0x5a84cc(0x105)](function (_0x54faf3) {
      return fancy12chrmap[_0x54faf3] ? fancy12chrmap[_0x54faf3] : _0x54faf3;
    })
    [_0x5a84cc(0x107)]("");
}
const fancy13chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝘢",
  b: "𝘣",
  c: "𝘤",
  d: "𝘥",
  e: "𝘦",
  f: "𝘧",
  g: "𝘨",
  h: "𝘩",
  i: "𝘪",
  j: "𝘫",
  k: "𝘬",
  l: "𝘭",
  m: "𝘮",
  n: "𝘯",
  o: "𝘰",
  p: "𝘱",
  q: "𝘲",
  r: "𝘳",
  s: "𝘴",
  t: "𝘵",
  u: "𝘶",
  v: "𝘷",
  w: "𝘸",
  x: "𝘹",
  y: "𝘺",
  z: "𝘻",
  A: "𝘈",
  B: "𝘉",
  C: "𝘊",
  D: "𝘋",
  E: "𝘌",
  F: "𝘍",
  G: "𝘎",
  H: "𝘏",
  I: "𝘐",
  J: "𝘑",
  K: "𝘒",
  L: "𝘓",
  M: "𝘔",
  N: "𝘕",
  O: "𝘖",
  P: "𝘗",
  Q: "𝘘",
  R: "𝘙",
  S: "𝘚",
  T: "𝘛",
  U: "𝘜",
  V: "𝘝",
  W: "𝘞",
  X: "𝘟",
  Y: "𝘠",
  Z: "𝘡",
};
function fancy13(_0x590a97) {
  var _0x557750 = _0x351ba0;
  return _0x590a97["split"]("")
    [_0x557750(0x105)](function (_0x2e106e) {
      return fancy13chrmap[_0x2e106e] ? fancy13chrmap[_0x2e106e] : _0x2e106e;
    })
    [_0x557750(0x107)]("");
}
const fancy14chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "α",
  b: "Ⴆ",
  c: "ƈ",
  d: "ԃ",
  e: "ҽ",
  f: "ϝ",
  g: "ɠ",
  h: "ԋ",
  i: "ι",
  j: "ʝ",
  k: "ƙ",
  l: "ʅ",
  m: "ɱ",
  n: "ɳ",
  o: "σ",
  p: "ρ",
  q: "ϙ",
  r: "ɾ",
  s: "ʂ",
  t: "ƚ",
  u: "υ",
  v: "ʋ",
  w: "ɯ",
  x: "x",
  y: "ყ",
  z: "ȥ",
  A: "A",
  B: "B",
  C: "C",
  D: "D",
  E: "E",
  F: "F",
  G: "G",
  H: "H",
  I: "I",
  J: "J",
  K: "K",
  L: "L",
  M: "M",
  N: "N",
  O: "O",
  P: "P",
  Q: "Q",
  R: "R",
  S: "S",
  T: "T",
  U: "U",
  V: "V",
  W: "W",
  X: "X",
  Y: "Y",
  Z: "Z",
};
function fancy14(_0x54dff6) {
  var _0xdaceeb = _0x351ba0;
  return _0x54dff6[_0xdaceeb(0x126)]("")
    [_0xdaceeb(0x105)](function (_0x57e042) {
      return fancy14chrmap[_0x57e042] ? fancy14chrmap[_0x57e042] : _0x57e042;
    })
    ["join"]("");
}
function _0x326a() {
  var _0x54ff5d = [
    "4PLqsRd",
    "📫︎",
    "🕿︎",
    "&nbsp;",
    "🕛︎",
    "squares",
    "flip",
    "getHTML",
    "split",
    "🖫︎",
    "reverse",
    "pop",
    "undefined",
    "bottom",
    "📁︎",
    "floor",
    "<br>\x0a",
    "exports",
    "middle",
    "mapInverse",
    "19660WuGBBs",
    "💣︎",
    "creepify",
    "charCodeAt",
    "2055609HSDycK",
    "length",
    "diacriticsBottom",
    "🕮︎",
    "😐︎",
    "options",
    "🕭︎",
    "top",
    "🏱︎",
    "encode",
    "📄︎",
    "1769649qXxshi",
    "&#x",
    "📂︎",
    "🖰︎",
    "🕖︎",
    "🕔︎",
    "tools",
    "🖬︎",
    "toString",
    "trim",
    "🖂︎",
    "push",
    "diacriticsMiddle",
    "👎︎",
    "🕈︎",
    "📪︎",
    "maxHeight",
    "🕗︎",
    "fromCharCode",
    "🗏︎",
    "map",
    "🕕︎",
    "join",
    "4MEhffE",
    "charAt",
    "9560630bbALkY",
    "2564040okZfrD",
    "👌︎",
    "2901990ycRtht",
    "randomization",
    "stringify",
    "🕙︎",
    "711298FRTiJP",
    "random",
    "🗄︎",
    "diacriticsTop",
    "roundsquares",
    "🕆︎",
    "🖴︎",
    "🖲︎",
    "🕯︎",
    "������",
    "💧︎",
    "40aZBjFX",
    "🕑︎",
  ];
  _0x326a = function () {
    return _0x54ff5d;
  };
  return _0x326a();
}
const fancy15chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "₳",
  b: "฿",
  c: "₵",
  d: "Đ",
  e: "Ɇ",
  f: "₣",
  g: "₲",
  h: "Ⱨ",
  i: "ł",
  j: "J",
  k: "₭",
  l: "Ⱡ",
  m: "₥",
  n: "₦",
  o: "Ø",
  p: "₱",
  q: "Q",
  r: "Ɽ",
  s: "₴",
  t: "₮",
  u: "Ʉ",
  v: "V",
  w: "₩",
  x: "Ӿ",
  y: "Ɏ",
  z: "Ⱬ",
  A: "₳",
  B: "฿",
  C: "₵",
  D: "Đ",
  E: "Ɇ",
  F: "₣",
  G: "₲",
  H: "Ⱨ",
  I: "ł",
  J: "J",
  K: "₭",
  L: "Ⱡ",
  M: "₥",
  N: "₦",
  O: "Ø",
  P: "₱",
  Q: "Q",
  R: "Ɽ",
  S: "₴",
  T: "₮",
  U: "Ʉ",
  V: "V",
  W: "₩",
  X: "Ӿ",
  Y: "Ɏ",
  Z: "Ⱬ",
};
function fancy15(_0x215eea) {
  var _0x48eb71 = _0x351ba0;
  return _0x215eea[_0x48eb71(0x126)]("")
    ["map"](function (_0x37d796) {
      return fancy15chrmap[_0x37d796] ? fancy15chrmap[_0x37d796] : _0x37d796;
    })
    ["join"]("");
}
const fancy16chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "å",
  b: "ß",
  c: "¢",
  d: "Ð",
  e: "ê",
  f: "£",
  g: "g",
  h: "h",
  i: "ï",
  j: "j",
  k: "k",
  l: "l",
  m: "m",
  n: "ñ",
  o: "ð",
  p: "þ",
  q: "q",
  r: "r",
  s: "§",
  t: "†",
  u: "µ",
  v: "v",
  w: "w",
  x: "x",
  y: "¥",
  z: "z",
  A: "Ä",
  B: "ß",
  C: "Ç",
  D: "Ð",
  E: "È",
  F: "£",
  G: "G",
  H: "H",
  I: "Ì",
  J: "J",
  K: "K",
  L: "L",
  M: "M",
  N: "ñ",
  O: "Ö",
  P: "þ",
  Q: "Q",
  R: "R",
  S: "§",
  T: "†",
  U: "Ú",
  V: "V",
  W: "W",
  X: "×",
  Y: "¥",
  Z: "Z",
};
function fancy16(_0x17c0bb) {
  var _0x5ed3fc = _0x351ba0;
  return _0x17c0bb[_0x5ed3fc(0x126)]("")
    [_0x5ed3fc(0x105)](function (_0x24bd55) {
      return fancy16chrmap[_0x24bd55] ? fancy16chrmap[_0x24bd55] : _0x24bd55;
    })
    ["join"]("");
}
const fancy17chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "α",
  b: "в",
  c: "¢",
  d: "∂",
  e: "є",
  f: "ƒ",
  g: "g",
  h: "н",
  i: "ι",
  j: "נ",
  k: "к",
  l: "ℓ",
  m: "м",
  n: "η",
  o: "σ",
  p: "ρ",
  q: "q",
  r: "я",
  s: "ѕ",
  t: "т",
  u: "υ",
  v: "ν",
  w: "ω",
  x: "χ",
  y: "у",
  z: "z",
  A: "α",
  B: "в",
  C: "¢",
  D: "∂",
  E: "є",
  F: "ƒ",
  G: "g",
  H: "н",
  I: "ι",
  J: "נ",
  K: "к",
  L: "ℓ",
  M: "м",
  N: "η",
  O: "σ",
  P: "ρ",
  Q: "q",
  R: "я",
  S: "ѕ",
  T: "т",
  U: "υ",
  V: "ν",
  W: "ω",
  X: "χ",
  Y: "у",
  Z: "z",
};
function fancy17(_0x1d22da) {
  var _0x20cbd8 = _0x351ba0;
  return _0x1d22da["split"]("")
    [_0x20cbd8(0x105)](function (_0xdf89bd) {
      return fancy17chrmap[_0xdf89bd] ? fancy17chrmap[_0xdf89bd] : _0xdf89bd;
    })
    [_0x20cbd8(0x107)]("");
}
const fancy18chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "Λ",
  b: "B",
  c: "ᄃ",
  d: "D",
  e: "Σ",
  f: "F",
  g: "G",
  h: "Ή",
  i: "I",
  j: "J",
  k: "K",
  l: "ᄂ",
  m: "M",
  n: "П",
  o: "Ө",
  p: "P",
  q: "Q",
  r: "Я",
  s: "Ƨ",
  t: "Ƭ",
  u: "Ц",
  v: "V",
  w: "Щ",
  x: "X",
  y: "Y",
  z: "Z",
  A: "Λ",
  B: "B",
  C: "ᄃ",
  D: "D",
  E: "Σ",
  F: "F",
  G: "G",
  H: "Ή",
  I: "I",
  J: "J",
  K: "K",
  L: "ᄂ",
  M: "M",
  N: "П",
  O: "Ө",
  P: "P",
  Q: "Q",
  R: "Я",
  S: "Ƨ",
  T: "Ƭ",
  U: "Ц",
  V: "V",
  W: "Щ",
  X: "X",
  Y: "Y",
  Z: "Z",
};
function fancy18(_0x1b2296) {
  var _0x4243ec = _0x351ba0;
  return _0x1b2296[_0x4243ec(0x126)]("")
    [_0x4243ec(0x105)](function (_0x536be6) {
      return fancy18chrmap[_0x536be6] ? fancy18chrmap[_0x536be6] : _0x536be6;
    })
    ["join"]("");
}
const fancy19chrmap = {
  0: "⊘",
  1: "𝟙",
  2: "ϩ",
  3: "Ӡ",
  4: "५",
  5: "Ƽ",
  6: "Ϭ",
  7: "7",
  8: "𝟠",
  9: "९",
  a: "ą",
  b: "ҍ",
  c: "ç",
  d: "ժ",
  e: "ҽ",
  f: "ƒ",
  g: "ց",
  h: "հ",
  i: "ì",
  j: "ʝ",
  k: "ҟ",
  l: "Ӏ",
  m: "ʍ",
  n: "ղ",
  o: "օ",
  p: "ք",
  q: "զ",
  r: "ɾ",
  s: "ʂ",
  t: "է",
  u: "մ",
  v: "ѵ",
  w: "ա",
  x: "×",
  y: "վ",
  z: "Հ",
  A: "Ⱥ",
  B: "β",
  C: "↻",
  D: "Ꭰ",
  E: "Ɛ",
  F: "Ƒ",
  G: "Ɠ",
  H: "Ƕ",
  I: "į",
  J: "ل",
  K: "Ҡ",
  L: "Ꝉ",
  M: "Ɱ",
  N: "ហ",
  O: "ට",
  P: "φ",
  Q: "Ҩ",
  R: "འ",
  S: "Ϛ",
  T: "Ͳ",
  U: "Ա",
  V: "Ỽ",
  W: "చ",
  X: "ჯ",
  Y: "Ӌ",
  Z: "ɀ",
};
function fancy19(_0x2152b0) {
  var _0x5e154a = _0x351ba0;
  return _0x2152b0[_0x5e154a(0x126)]("")
    [_0x5e154a(0x105)](function (_0x4bfb1c) {
      return fancy19chrmap[_0x4bfb1c] ? fancy19chrmap[_0x4bfb1c] : _0x4bfb1c;
    })
    [_0x5e154a(0x107)]("");
}
const fancy20chrmap = {
  0: "₀",
  1: "₁",
  2: "₂",
  3: "₃",
  4: "₄",
  5: "₅",
  6: "₆",
  7: "₇",
  8: "₈",
  9: "₉",
  a: "ₐ",
  b: "b",
  c: "c",
  d: "d",
  e: "ₑ",
  f: "f",
  g: "g",
  h: "ₕ",
  i: "ᵢ",
  j: "ⱼ",
  k: "ₖ",
  l: "ₗ",
  m: "ₘ",
  n: "ₙ",
  o: "ₒ",
  p: "ₚ",
  q: "q",
  r: "ᵣ",
  s: "ₛ",
  t: "ₜ",
  u: "ᵤ",
  v: "ᵥ",
  w: "w",
  x: "ₓ",
  y: "y",
  z: "z",
  A: "ₐ",
  B: "B",
  C: "C",
  D: "D",
  E: "ₑ",
  F: "F",
  G: "G",
  H: "ₕ",
  I: "ᵢ",
  J: "ⱼ",
  K: "ₖ",
  L: "ₗ",
  M: "ₘ",
  N: "ₙ",
  O: "ₒ",
  P: "ₚ",
  Q: "Q",
  R: "ᵣ",
  S: "ₛ",
  T: "ₜ",
  U: "ᵤ",
  V: "ᵥ",
  W: "W",
  X: "ₓ",
  Y: "Y",
  Z: "Z",
};
function fancy20(_0x2a180e) {
  var _0x5c8f55 = _0x351ba0;
  return _0x2a180e[_0x5c8f55(0x126)]("")
    [_0x5c8f55(0x105)](function (_0x43aaed) {
      return fancy20chrmap[_0x43aaed] ? fancy20chrmap[_0x43aaed] : _0x43aaed;
    })
    [_0x5c8f55(0x107)]("");
}
const fancy21chrmap = {
  0: "⁰",
  1: "¹",
  2: "²",
  3: "³",
  4: "⁴",
  5: "⁵",
  6: "⁶",
  7: "⁷",
  8: "⁸",
  9: "⁹",
  a: "ᵃ",
  b: "ᵇ",
  c: "ᶜ",
  d: "ᵈ",
  e: "ᵉ",
  f: "ᶠ",
  g: "ᵍ",
  h: "ʰ",
  i: "ⁱ",
  j: "ʲ",
  k: "ᵏ",
  l: "ˡ",
  m: "ᵐ",
  n: "ⁿ",
  o: "ᵒ",
  p: "ᵖ",
  q: "q",
  r: "ʳ",
  s: "ˢ",
  t: "ᵗ",
  u: "ᵘ",
  v: "ᵛ",
  w: "ʷ",
  x: "ˣ",
  y: "ʸ",
  z: "ᶻ",
  A: "ᴬ",
  B: "ᴮ",
  C: "ᶜ",
  D: "ᴰ",
  E: "ᴱ",
  F: "ᶠ",
  G: "ᴳ",
  H: "ᴴ",
  I: "ᴵ",
  J: "ᴶ",
  K: "ᴷ",
  L: "ᴸ",
  M: "ᴹ",
  N: "ᴺ",
  O: "ᴼ",
  P: "ᴾ",
  Q: "Q",
  R: "ᴿ",
  S: "ˢ",
  T: "ᵀ",
  U: "ᵁ",
  V: "ⱽ",
  W: "ᵂ",
  X: "ˣ",
  Y: "ʸ",
  Z: "ᶻ",
};
function fancy21(_0x51703f) {
  var _0x5e54d0 = _0x351ba0;
  return _0x51703f[_0x5e54d0(0x126)]("")
    [_0x5e54d0(0x105)](function (_0x719623) {
      return fancy21chrmap[_0x719623] ? fancy21chrmap[_0x719623] : _0x719623;
    })
    ["join"]("");
}
const fancy22chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "ค",
  b: "๒",
  c: "ς",
  d: "๔",
  e: "є",
  f: "Ŧ",
  g: "ﻮ",
  h: "ђ",
  i: "เ",
  j: "ן",
  k: "к",
  l: "ɭ",
  m: "๓",
  n: "ภ",
  o: "๏",
  p: "ק",
  q: "ợ",
  r: "г",
  s: "ร",
  t: "Շ",
  u: "ย",
  v: "ש",
  w: "ฬ",
  x: "א",
  y: "ץ",
  z: "չ",
  A: "ค",
  B: "๒",
  C: "ς",
  D: "๔",
  E: "є",
  F: "Ŧ",
  G: "ﻮ",
  H: "ђ",
  I: "เ",
  J: "ן",
  K: "к",
  L: "ɭ",
  M: "๓",
  N: "ภ",
  O: "๏",
  P: "ק",
  Q: "ợ",
  R: "г",
  S: "ร",
  T: "Շ",
  U: "ย",
  V: "ש",
  W: "ฬ",
  X: "א",
  Y: "ץ",
  Z: "չ",
};
function fancy22(_0x26b855) {
  var _0x4825d1 = _0x351ba0;
  return _0x26b855[_0x4825d1(0x126)]("")
    ["map"](function (_0x2b3e06) {
      return fancy22chrmap[_0x2b3e06] ? fancy22chrmap[_0x2b3e06] : _0x2b3e06;
    })
    [_0x4825d1(0x107)]("");
}
const fancy23chrmap = {
  0: "𝟘",
  1: "𝟙",
  2: "𝟚",
  3: "𝟛",
  4: "𝟜",
  5: "𝟝",
  6: "𝟞",
  7: "𝟟",
  8: "𝟠",
  9: "𝟡",
  a: "𝕒",
  b: "𝕓",
  c: "𝕔",
  d: "𝕕",
  e: "𝕖",
  f: "𝕗",
  g: "𝕘",
  h: "𝕙",
  i: "𝕚",
  j: "𝕛",
  k: "𝕜",
  l: "𝕝",
  m: "𝕞",
  n: "𝕟",
  o: "𝕠",
  p: "𝕡",
  q: "𝕢",
  r: "𝕣",
  s: "𝕤",
  t: "𝕥",
  u: "𝕦",
  v: "𝕧",
  w: "𝕨",
  x: "𝕩",
  y: "𝕪",
  z: "𝕫",
  A: "𝔸",
  B: "𝔹",
  C: "ℂ",
  D: "𝔻",
  E: "𝔼",
  F: "𝔽",
  G: "𝔾",
  H: "ℍ",
  I: "𝕀",
  J: "𝕁",
  K: "𝕂",
  L: "𝕃",
  M: "𝕄",
  N: "ℕ",
  O: "𝕆",
  P: "ℙ",
  Q: "ℚ",
  R: "ℝ",
  S: "𝕊",
  T: "𝕋",
  U: "𝕌",
  V: "𝕍",
  W: "𝕎",
  X: "𝕏",
  Y: "𝕐",
  Z: "ℤ",
};
function fancy23(_0x306242) {
  var _0xd294e3 = _0x351ba0;
  return _0x306242["split"]("")
    ["map"](function (_0x5d362d) {
      return fancy23chrmap[_0x5d362d] ? fancy23chrmap[_0x5d362d] : _0x5d362d;
    })
    [_0xd294e3(0x107)]("");
}
const fancy24chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝖆",
  b: "𝖇",
  c: "𝖈",
  d: "𝖉",
  e: "𝖊",
  f: "𝖋",
  g: "𝖌",
  h: "𝖍",
  i: "𝖎",
  j: "𝖏",
  k: "𝖐",
  l: "𝖑",
  m: "𝖒",
  n: "𝖓",
  o: "𝖔",
  p: "𝖕",
  q: "𝖖",
  r: "𝖗",
  s: "𝖘",
  t: "𝖙",
  u: "𝖚",
  v: "𝖛",
  w: "𝖜",
  x: "𝖝",
  y: "𝖞",
  z: "𝖟",
  A: "𝕬",
  B: "𝕭",
  C: "𝕮",
  D: "𝕯",
  E: "𝕰",
  F: "𝕱",
  G: "𝕲",
  H: "𝕳",
  I: "𝕴",
  J: "𝕵",
  K: "𝕶",
  L: "𝕷",
  M: "𝕸",
  N: "𝕹",
  O: "𝕺",
  P: "𝕻",
  Q: "𝕼",
  R: "𝕽",
  S: "𝕾",
  T: "𝕿",
  U: "𝖀",
  V: "𝖁",
  W: "𝖂",
  X: "𝖃",
  Y: "𝖄",
  Z: "𝖅",
};
function fancy24(_0x44bad4) {
  var _0x1c98f8 = _0x351ba0;
  return _0x44bad4["split"]("")
    [_0x1c98f8(0x105)](function (_0xa1f61a) {
      return fancy24chrmap[_0xa1f61a] ? fancy24chrmap[_0xa1f61a] : _0xa1f61a;
    })
    ["join"]("");
}
const fancy25chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "🅰",
  b: "🅱",
  c: "🅲",
  d: "🅳",
  e: "🅴",
  f: "🅵",
  g: "🅶",
  h: "🅷",
  i: "🅸",
  j: "🅹",
  k: "🅺",
  l: "🅻",
  m: "🅼",
  n: "🅽",
  o: "🅾",
  p: "🅿",
  q: "🆀",
  r: "🆁",
  s: "🆂",
  t: "🆃",
  u: "🆄",
  v: "🆅",
  w: "🆆",
  x: "🆇",
  y: "🆈",
  z: "🆉",
  A: "🅰",
  B: "🅱",
  C: "🅲",
  D: "🅳",
  E: "🅴",
  F: "🅵",
  G: "🅶",
  H: "🅷",
  I: "🅸",
  J: "🅹",
  K: "🅺",
  L: "🅻",
  M: "🅼",
  N: "🅽",
  O: "🅾",
  P: "🅿",
  Q: "🆀",
  R: "🆁",
  S: "🆂",
  T: "🆃",
  U: "🆄",
  V: "🆅",
  W: "🆆",
  X: "🆇",
  Y: "🆈",
  Z: "🆉",
};
function fancy25(_0x914c7d) {
  var _0x4df9e5 = _0x351ba0;
  return _0x914c7d[_0x4df9e5(0x126)]("")
    ["map"](function (_0x3b8f6b) {
      return fancy25chrmap[_0x3b8f6b] ? fancy25chrmap[_0x3b8f6b] : _0x3b8f6b;
    })
    [_0x4df9e5(0x107)]("");
}
const fancy26chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝓪",
  b: "𝓫",
  c: "𝓬",
  d: "𝓭",
  e: "𝓮",
  f: "𝓯",
  g: "𝓰",
  h: "𝓱",
  i: "𝓲",
  j: "𝓳",
  k: "𝓴",
  l: "𝓵",
  m: "𝓶",
  n: "𝓷",
  o: "𝓸",
  p: "𝓹",
  q: "𝓺",
  r: "𝓻",
  s: "𝓼",
  t: "𝓽",
  u: "𝓾",
  v: "𝓿",
  w: "𝔀",
  x: "𝔁",
  y: "𝔂",
  z: "𝔃",
  A: "𝓐",
  B: "𝓑",
  C: "𝓒",
  D: "𝓓",
  E: "𝓔",
  F: "𝓕",
  G: "𝓖",
  H: "𝓗",
  I: "𝓘",
  J: "𝓙",
  K: "𝓚",
  L: "𝓛",
  M: "𝓜",
  N: "𝓝",
  O: "𝓞",
  P: "𝓟",
  Q: "𝓠",
  R: "𝓡",
  S: "𝓢",
  T: "𝓣",
  U: "𝓤",
  V: "𝓥",
  W: "𝓦",
  X: "𝓧",
  Y: "𝓨",
  Z: "𝓩",
};
function fancy26(_0x4d8279) {
  var _0x479f18 = _0x351ba0;
  return _0x4d8279[_0x479f18(0x126)]("")
    [_0x479f18(0x105)](function (_0x5da658) {
      return fancy26chrmap[_0x5da658] ? fancy26chrmap[_0x5da658] : _0x5da658;
    })
    ["join"]("");
}
const fancy27chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝔞",
  b: "𝔟",
  c: "𝔠",
  d: "𝔡",
  e: "𝔢",
  f: "𝔣",
  g: "𝔤",
  h: "𝔥",
  i: "𝔦",
  j: "𝔧",
  k: "𝔨",
  l: "𝔩",
  m: "𝔪",
  n: "𝔫",
  o: "𝔬",
  p: "𝔭",
  q: "𝔮",
  r: "𝔯",
  s: "𝔰",
  t: "𝔱",
  u: "𝔲",
  v: "𝔳",
  w: "𝔴",
  x: "𝔵",
  y: "𝔶",
  z: "𝔷",
  A: "𝔄",
  B: "𝔅",
  C: "ℭ",
  D: "𝔇",
  E: "𝔈",
  F: "𝔉",
  G: "𝔊",
  H: "ℌ",
  I: "ℑ",
  J: "𝔍",
  K: "𝔎",
  L: "𝔏",
  M: "𝔐",
  N: "𝔑",
  O: "�",
  P: "𝔓",
  Q: "𝔔",
  R: "ℜ",
  S: "𝔖",
  T: "𝔗",
  U: "𝔘",
  V: "𝔙",
  W: "𝔚",
  X: "𝔛",
  Y: "𝔜",
  Z: "ℨ",
};
function fancy27(_0x50eb93) {
  var _0x502d54 = _0x351ba0;
  return _0x50eb93[_0x502d54(0x126)]("")
    [_0x502d54(0x105)](function (_0x26559f) {
      return fancy27chrmap[_0x26559f] ? fancy27chrmap[_0x26559f] : _0x26559f;
    })
    ["join"]("");
}
const fancy28chrmap = {
  0: "０",
  1: "１",
  2: "２",
  3: "３",
  4: "４",
  5: "５",
  6: "６",
  7: "７",
  8: "８",
  9: "９",
  a: "ａ",
  b: "ｂ",
  c: "ｃ",
  d: "ｄ",
  e: "ｅ",
  f: "ｆ",
  g: "ｇ",
  h: "ｈ",
  i: "ｉ",
  j: "ｊ",
  k: "ｋ",
  l: "ｌ",
  m: "ｍ",
  n: "ｎ",
  o: "ｏ",
  p: "ｐ",
  q: "ｑ",
  r: "ｒ",
  s: "ｓ",
  t: "ｔ",
  u: "ｕ",
  v: "ｖ",
  w: "ｗ",
  x: "ｘ",
  y: "ｙ",
  z: "ｚ",
  A: "Ａ",
  B: "Ｂ",
  C: "Ｃ",
  D: "Ｄ",
  E: "Ｅ",
  F: "Ｆ",
  G: "Ｇ",
  H: "Ｈ",
  I: "Ｉ",
  J: "Ｊ",
  K: "Ｋ",
  L: "Ｌ",
  M: "Ｍ",
  N: "Ｎ",
  O: "Ｏ",
  P: "Ｐ",
  Q: "Ｑ",
  R: "Ｒ",
  S: "Ｓ",
  T: "Ｔ",
  U: "Ｕ",
  V: "Ｖ",
  W: "Ｗ",
  X: "Ｘ",
  Y: "Ｙ",
  Z: "Ｚ",
};
function fancy28(_0x21bb41) {
  var _0x2fa902 = _0x351ba0;
  return _0x21bb41[_0x2fa902(0x126)]("")
    [_0x2fa902(0x105)](function (_0x3481a1) {
      return fancy28chrmap[_0x3481a1] ? fancy28chrmap[_0x3481a1] : _0x3481a1;
    })
    ["join"]("");
}
const fancy29chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝒂",
  b: "𝒃",
  c: "𝒄",
  d: "𝒅",
  e: "𝒆",
  f: "𝒇",
  g: "𝒈",
  h: "𝒉",
  i: "𝒊",
  j: "𝒋",
  k: "𝒌",
  l: "𝒍",
  m: "𝒎",
  n: "𝒏",
  o: "𝒐",
  p: "𝒑",
  q: "𝒒",
  r: "𝒓",
  s: "𝒔",
  t: "𝒕",
  u: "𝒖",
  v: "𝒗",
  w: "𝒘",
  x: "𝒙",
  y: "𝒚",
  z: "𝒛",
  A: "𝑨",
  B: "𝑩",
  C: "𝑪",
  D: "𝑫",
  E: "𝑬",
  F: "𝑭",
  G: "𝑮",
  H: "𝑯",
  I: "𝑰",
  J: "𝑱",
  K: "𝑲",
  L: "𝑳",
  M: "𝑴",
  N: "𝑵",
  O: "𝑶",
  P: "𝑷",
  Q: "𝑸",
  R: "𝑹",
  S: "𝑺",
  T: "𝑻",
  U: "𝑼",
  V: "𝑽",
  W: "𝑾",
  X: "𝑿",
  Y: "𝒀",
  Z: "𝒁",
};
function fancy29(_0x2b3163) {
  var _0x275a81 = _0x351ba0;
  return _0x2b3163[_0x275a81(0x126)]("")
    [_0x275a81(0x105)](function (_0x2290f7) {
      return fancy29chrmap[_0x2290f7] ? fancy29chrmap[_0x2290f7] : _0x2290f7;
    })
    ["join"]("");
}
const fancy30chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝛥",
  b: "𝐵",
  c: "𝐶",
  d: "𝐷",
  e: "𝛯",
  f: "𝐹",
  g: "𝐺",
  h: "𝛨",
  i: "𝛪",
  j: "𝐽",
  k: "𝛫",
  l: "𝐿",
  m: "𝛭",
  n: "𝛮",
  o: "𝛩",
  p: "𝛲",
  q: "𝑄",
  r: "𝑅",
  s: "𝑆",
  t: "𝑇",
  u: "𝑈",
  v: "𝛻",
  w: "𝑊",
  x: "𝛸",
  y: "𝑌",
  z: "𝛧",
  A: "𝛥",
  B: "𝐵",
  C: "𝐶",
  D: "𝐷",
  E: "𝛯",
  F: "𝐹",
  G: "𝐺",
  H: "𝛨",
  I: "𝛪",
  J: "𝐽",
  K: "𝛫",
  L: "𝐿",
  M: "𝛭",
  N: "𝛮",
  O: "𝛩",
  P: "𝛲",
  Q: "𝑄",
  R: "𝑅",
  S: "𝑆",
  T: "𝑇",
  U: "𝑈",
  V: "𝛻",
  W: "𝑊",
  X: "𝛸",
  Y: "𝑌",
  Z: "𝛧",
};
function fancy30(_0x1045cb) {
  var _0x293927 = _0x351ba0;
  return _0x1045cb[_0x293927(0x126)]("")
    [_0x293927(0x105)](function (_0x2f0d4c) {
      return fancy30chrmap[_0x2f0d4c] ? fancy30chrmap[_0x2f0d4c] : _0x2f0d4c;
    })
    [_0x293927(0x107)]("");
}
const fancy31chrmap = {
  0: "𝟬",
  1: "𝟭",
  2: "𝟮",
  3: "𝟯",
  4: "𝟰",
  5: "𝟱",
  6: "𝟲",
  7: "𝟳",
  8: "𝟴",
  9: "𝟵",
  a: "𝞓",
  b: "𝞑",
  c: "𝘾",
  d: "𝘿",
  e: "𝞢",
  f: "𝙁",
  g: "𝙂",
  h: "𝞖",
  i: "𝞘",
  j: "𝙅",
  k: "𝞙",
  l: "𝙇",
  m: "𝞛",
  n: "𝞜",
  o: "𝞗",
  p: "𝞠",
  q: "𝙌",
  r: "𝞒",
  s: "𝙎",
  t: "𝙏",
  u: "𝙐",
  v: "𝝯",
  w: "𝙒",
  x: "𝞦",
  y: "𝙔",
  z: "𝙕",
  A: "𝞓",
  B: "𝞑",
  C: "𝘾",
  D: "𝘿",
  E: "𝞢",
  F: "𝙁",
  G: "𝙂",
  H: "𝞖",
  I: "𝞘",
  J: "𝙅",
  K: "𝞙",
  L: "𝙇",
  M: "𝞛",
  N: "𝞜",
  O: "𝞗",
  P: "𝞠",
  Q: "𝙌",
  R: "𝞒",
  S: "𝙎",
  T: "𝙏",
  U: "𝙐",
  V: "𝝯",
  W: "𝙒",
  X: "𝞦",
  Y: "𝙔",
  Z: "𝙕",
};
function fancy31(_0xc90ef8) {
  return _0xc90ef8["split"]("")
    ["map"](function (_0x39d68f) {
      return fancy31chrmap[_0x39d68f] ? fancy31chrmap[_0x39d68f] : _0x39d68f;
    })
    ["join"]("");
}
function _0x459c(_0x54ddda, _0x35a21d) {
  var _0x326a3a = _0x326a();
  return (
    (_0x459c = function (_0x459cb6, _0x4b7774) {
      _0x459cb6 = _0x459cb6 - 0xfa;
      var _0x24e0e3 = _0x326a3a[_0x459cb6];
      return _0x24e0e3;
    }),
    _0x459c(_0x54ddda, _0x35a21d)
  );
}
const fancy32chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "𝚫",
  b: "𝚩",
  c: "𝐂",
  d: "𝐃",
  e: "𝚵",
  f: "𝐅",
  g: "𝐆",
  h: "𝚮",
  i: "𝚰",
  j: "𝐉",
  k: "𝐊",
  l: "𝐋",
  m: "𝚳",
  n: "𝚴",
  o: "𝚯",
  p: "𝚸",
  q: "𝐐",
  r: "𝚪",
  s: "𝐒",
  t: "𝚻",
  u: "𝐔",
  v: "𝛁",
  w: "𝐖",
  x: "𝚾",
  y: "𝐘",
  z: "𝚭",
  A: "𝚫",
  B: "𝚩",
  C: "𝐂",
  D: "𝐃",
  E: "𝚵",
  F: "𝐅",
  G: "𝐆",
  H: "𝚮",
  I: "𝚰",
  J: "𝐉",
  K: "𝐊",
  L: "𝐋",
  M: "𝚳",
  N: "𝚴",
  O: "𝚯",
  P: "𝚸",
  Q: "𝐐",
  R: "𝚪",
  S: "𝐒",
  T: "𝚻",
  U: "𝐔",
  V: "𝛁",
  W: "𝐖",
  X: "𝚾",
  Y: "𝐘",
  Z: "𝚭",
};
function fancy32(_0x43a052) {
  var _0x49d925 = _0x351ba0;
  return _0x43a052[_0x49d925(0x126)]("")
    [_0x49d925(0x105)](function (_0x5c80bf) {
      return fancy32chrmap[_0x5c80bf] ? fancy32chrmap[_0x5c80bf] : _0x5c80bf;
    })
    [_0x49d925(0x107)]("");
}
const fancy33chrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "ᗩ",
  b: "ᗷ",
  c: "ᑕ",
  d: "ᗞ",
  e: "ᗴ",
  f: "ᖴ",
  g: "Ꮐ",
  h: "ᕼ",
  i: "Ꮖ",
  j: "ᒍ",
  k: "Ꮶ",
  l: "し",
  m: "ᗰ",
  n: "ᑎ",
  o: "ᝪ",
  p: "ᑭ",
  q: "ᑫ",
  r: "ᖇ",
  s: "ᔑ",
  t: "Ꭲ",
  u: "ᑌ",
  v: "ᐯ",
  w: "ᗯ",
  x: "᙭",
  y: "Ꭹ",
  z: "Ꮓ",
  A: "ᗩ",
  B: "ᗷ",
  C: "ᑕ",
  D: "ᗞ",
  E: "ᗴ",
  F: "ᖴ",
  G: "Ꮐ",
  H: "ᕼ",
  I: "Ꮖ",
  J: "ᒍ",
  K: "Ꮶ",
  L: "し",
  M: "ᗰ",
  N: "ᑎ",
  O: "ᝪ",
  P: "ᑭ",
  Q: "ᑫ",
  R: "ᖇ",
  S: "ᔑ",
  T: "Ꭲ",
  U: "ᑌ",
  V: "ᐯ",
  W: "ᗯ",
  X: "᙭",
  Y: "Ꭹ",
  Z: "Ꮓ",
};
function fancy33(_0x11bbed) {
  var _0x14b318 = _0x351ba0;
  return _0x11bbed[_0x14b318(0x126)]("")
    ["map"](function (_0x4e4a87) {
      return fancy33chrmap[_0x4e4a87] ? fancy33chrmap[_0x4e4a87] : _0x4e4a87;
    })
    [_0x14b318(0x107)]("");
}
const tinyChrmap = {
  0: "0",
  1: "1",
  2: "2",
  3: "3",
  4: "4",
  5: "5",
  6: "6",
  7: "7",
  8: "8",
  9: "9",
  a: "ᴀ",
  b: "ʙ",
  c: "ᴄ",
  d: "ᴅ",
  e: "ᴇ",
  f: "ғ",
  g: "ɢ",
  h: "ʜ",
  i: "ɪ",
  j: "ᴊ",
  k: "ᴋ",
  l: "ʟ",
  m: "ᴍ",
  n: "ɴ",
  o: "ᴏ",
  p: "ᴘ",
  q: "ǫ",
  r: "ʀ",
  s: "s",
  t: "ᴛ",
  u: "ᴜ",
  v: "ᴠ",
  w: "ᴡ",
  x: "x",
  y: "ʏ",
  z: "ᴢ",
  A: "A",
  B: "ʙ",
  C: "C",
  D: "D",
  E: "E",
  F: "F",
  G: "G",
  H: "H",
  I: "I",
  J: "J",
  K: "K",
  L: "L",
  M: "M",
  N: "N",
  O: "O",
  P: "P",
  Q: "Q",
  R: "R",
  S: "S",
  T: "T",
  U: "U",
  V: "V",
  W: "W",
  X: "X",
  Y: "Y",
  Z: "Z",
};
function tiny(_0x1cb80c) {
  var _0x3232a7 = _0x351ba0;
  return _0x1cb80c[_0x3232a7(0x126)]("")
    [_0x3232a7(0x105)](function (_0x5d9e9c) {
      return tinyChrmap[_0x5d9e9c] ? tinyChrmap[_0x5d9e9c] : _0x5d9e9c;
    })
    [_0x3232a7(0x107)]("");
}
function ladybug(_0x1fff46) {
  var _0x5ec617 = _0x351ba0;
  return _0x1fff46[_0x5ec617(0x126)]("")
    [_0x5ec617(0x105)](function (_0xfa281a) {
      return ladybugCharMap[_0xfa281a] ? ladybugCharMap[_0xfa281a] : _0xfa281a;
    })
    [_0x5ec617(0x107)]("");
}
function runes(_0x306f7d) {
  var _0x11872b = _0x351ba0;
  return _0x306f7d[_0x11872b(0x126)]("")
    [_0x11872b(0x105)](function (_0x20460c) {
      return runesCharMap[_0x20460c] ? runesCharMap[_0x20460c] : _0x20460c;
    })
    [_0x11872b(0x107)]("");
}
function serif_B(_0x582e31) {
  var _0x5dab54 = _0x351ba0;
  return _0x582e31[_0x5dab54(0x126)]("")
    [_0x5dab54(0x105)](function (_0x2db854) {
      return serif_BCharMap[_0x2db854] ? serif_BCharMap[_0x2db854] : _0x2db854;
    })
    [_0x5dab54(0x107)]("");
}
function serif_BI(_0x101cfd) {
  var _0xd16d2c = _0x351ba0;
  return _0x101cfd[_0xd16d2c(0x126)]("")
    [_0xd16d2c(0x105)](function (_0x4f272f) {
      return serif_BICharMap[_0x4f272f]
        ? serif_BICharMap[_0x4f272f]
        : _0x4f272f;
    })
    [_0xd16d2c(0x107)]("");
}
function serif_I(_0x5e746c) {
  var _0x3a9216 = _0x351ba0;
  return _0x5e746c["split"]("")
    [_0x3a9216(0x105)](function (_0x4de071) {
      return serif_ICharMap[_0x4de071] ? serif_ICharMap[_0x4de071] : _0x4de071;
    })
    [_0x3a9216(0x107)]("");
}
function wingdings(_0x385dd4) {
  var _0x10552a = _0x351ba0;
  return _0x385dd4[_0x10552a(0x126)]("")
    [_0x10552a(0x105)](function (_0x50cb3d) {
      return wingdingsCharMap[_0x50cb3d]
        ? wingdingsCharMap[_0x50cb3d]
        : _0x50cb3d;
    })
    [_0x10552a(0x107)]("");
}
function vaporwave(_0x50e855) {
  var _0x3cc2c4 = _0x351ba0;
  return _0x50e855[_0x3cc2c4(0x126)]("")
    [_0x3cc2c4(0x105)](function (_0xecf796) {
      return vaporwaveCharMap[_0xecf796]
        ? vaporwaveCharMap[_0xecf796]
        : _0xecf796;
    })
    [_0x3cc2c4(0x107)]("");
}
function sparrow(_0x5b0223) {
  var _0x1890bb = _0x351ba0;
  return _0x5b0223["split"]("")
    [_0x1890bb(0x105)](function (_0x4402b6) {
      return sparrowCharMap[_0x4402b6] ? sparrowCharMap[_0x4402b6] : _0x4402b6;
    })
    ["join"]("");
}
function typewriter(_0xdadbc3) {
  var _0x5de935 = _0x351ba0;
  return _0xdadbc3[_0x5de935(0x126)]("")
    [_0x5de935(0x105)](function (_0x49f23f) {
      return typewriterCharMap[_0x49f23f]
        ? typewriterCharMap[_0x49f23f]
        : _0x49f23f;
    })
    [_0x5de935(0x107)]("");
}
function analucia(_0x440640) {
  var _0x5ef601 = _0x351ba0;
  return _0x440640[_0x5ef601(0x126)]("")
    [_0x5ef601(0x105)](function (_0x327331) {
      return analuciaCharMap[_0x327331]
        ? analuciaCharMap[_0x327331]
        : _0x327331;
    })
    ["join"]("");
}
function StyleText() {
  var _0x355f23 = _0x351ba0;
  this["tools"] = {
    flip: {
      init: function () {
        var _0x124779 = _0x459c;
        for (i in this[_0x124779(0x105)]) {
          this[_0x124779(0x105)][this[_0x124779(0x105)][i]] = i;
        }
      },
      encode: function (_0x59bb2b) {
        var _0x375bba = _0x459c,
          _0x16101a = [],
          _0x31a18a;
        for (
          var _0x3086b3 = 0x0, _0x264d17 = _0x59bb2b[_0x375bba(0x137)];
          _0x3086b3 < _0x264d17;
          _0x3086b3++
        ) {
          (_0x31a18a = _0x59bb2b[_0x375bba(0x109)](_0x3086b3)),
            _0x3086b3 > 0x0 &&
            (_0x31a18a == "̤" ||
              _0x31a18a == "̗" ||
              _0x31a18a == "̖" ||
              _0x31a18a == "̮")
              ? ((_0x31a18a =
                  this[_0x375bba(0x105)][
                    _0x59bb2b[_0x375bba(0x109)](_0x3086b3 - 0x1) + _0x31a18a
                  ]),
                _0x16101a[_0x375bba(0x129)]())
              : ((_0x31a18a = this[_0x375bba(0x105)][_0x31a18a]),
                typeof _0x31a18a == _0x375bba(0x12a) &&
                  (_0x31a18a = _0x59bb2b[_0x375bba(0x109)](_0x3086b3))),
            _0x16101a[_0x375bba(0xfc)](_0x31a18a);
        }
        return _0x16101a["reverse"]()[_0x375bba(0x107)]("");
      },
      decode: function (_0x82c03c) {
        var _0x44fee8 = _0x459c,
          _0x1df757 = [],
          _0x57b1c6;
        for (
          var _0x9dfc35 = 0x0, _0x9c7f18 = _0x82c03c["length"];
          _0x9dfc35 < _0x9c7f18;
          _0x9dfc35++
        ) {
          (_0x57b1c6 = _0x82c03c[_0x44fee8(0x109)](_0x9dfc35)),
            _0x9dfc35 > 0x0 &&
            (_0x57b1c6 == "̤" ||
              _0x57b1c6 == "̗" ||
              _0x57b1c6 == "̖" ||
              _0x57b1c6 == "̮")
              ? ((_0x57b1c6 =
                  this[_0x44fee8(0x105)][
                    _0x82c03c[_0x44fee8(0x109)](_0x9dfc35 - 0x1) + _0x57b1c6
                  ]),
                _0x1df757["pop"]())
              : ((_0x57b1c6 = this[_0x44fee8(0x105)][_0x57b1c6]),
                typeof _0x57b1c6 == _0x44fee8(0x12a) &&
                  (_0x57b1c6 = _0x82c03c[_0x44fee8(0x109)](_0x9dfc35))),
            _0x1df757["push"](_0x57b1c6);
        }
        return _0x1df757[_0x44fee8(0x128)]()["join"]("");
      },
      map: {
        a: "ɐ",
        b: "q",
        c: "ɔ",
        d: "p",
        e: "ǝ",
        f: "ɟ",
        g: "ɓ",
        h: "ɥ",
        i: "ı",
        j: "ɾ",
        k: "ʞ",
        l: "l",
        m: "ɯ",
        n: "u",
        r: "ɹ",
        t: "ʇ",
        v: "ʌ",
        w: "ʍ",
        y: "ʎ",
        A: "∀",
        B: "ᙠ",
        C: "Ɔ",
        D: "ᗡ",
        E: "Ǝ",
        F: "Ⅎ",
        G: "⅁",
        J: "ſ",
        K: "⋊",
        L: "˥",
        M: "W",
        P: "Ԁ",
        Q: "Ό",
        R: "ᴚ",
        T: "⊥",
        U: "∩",
        V: "Λ",
        Y: "⅄",
        0x1: "⇂",
        0x2: "ᄅ",
        0x3: "Ɛ",
        0x4: "ㄣ",
        0x5: "ގ",
        0x6: "9",
        0x7: "ㄥ",
        "&": "⅋",
        ".": "˙",
        "\x22": "„",
        ";": "؛",
        "[": "]",
        "(": ")",
        "{": "}",
        "?": "¿",
        "!": "¡",
        "\x27": ",",
        "<": ">",
        "‾": "_",
        "¯": "_",
        "‿": "⁀",
        "⁅": "⁆",
        "∴": "∵",
        "\x0d": "\x0a",
        ß: "ᙠ",
        "̈": "̤",
        ä: "ɐ̤",
        ö: "o̤",
        ü: "n̤",
        Ä: "∀̤",
        Ö: "O̤",
        Ü: "∩̤",
        "´": "\x20̗",
        é: "ǝ̗",
        á: "ɐ̗",
        ó: "o̗",
        ú: "n̗",
        É: "Ǝ̗",
        Á: "∀̗",
        Ó: "O̗",
        Ú: "∩̗",
        "`": "\x20̖",
        è: "ǝ̖",
        à: "ɐ̖",
        ò: "o̖",
        ù: "n̖",
        È: "Ǝ̖",
        À: "∀̖",
        Ò: "O̖",
        Ù: "∩̖",
        "^": "\x20̮",
        ê: "ǝ̮",
        â: "ɐ̮",
        ô: "o̮",
        û: "n̮",
        Ê: "Ǝ̮",
        Â: "∀̮",
        Ô: "O̮",
        Û: "∩̮",
      },
    },
    mirror: {
      init: function () {
        var _0x1a370d = _0x459c;
        for (i in this["map"]) {
          this["map"][this[_0x1a370d(0x105)][i]] = i;
        }
      },
      encode: function (_0x42240d) {
        var _0x3ae563 = _0x459c,
          _0x296ed5 = [],
          _0x532ffb,
          _0x544afb = [];
        for (
          var _0x4fdb7b = 0x0, _0xd1ce9b = _0x42240d["length"];
          _0x4fdb7b < _0xd1ce9b;
          _0x4fdb7b++
        ) {
          (_0x532ffb = _0x42240d[_0x3ae563(0x109)](_0x4fdb7b)),
            _0x4fdb7b > 0x0 &&
            (_0x532ffb == "̈" ||
              _0x532ffb == "̀" ||
              _0x532ffb == "́" ||
              _0x532ffb == "̂")
              ? ((_0x532ffb =
                  this["map"][
                    _0x42240d[_0x3ae563(0x109)](_0x4fdb7b - 0x1) + _0x532ffb
                  ]),
                _0x296ed5[_0x3ae563(0x129)]())
              : ((_0x532ffb = this[_0x3ae563(0x105)][_0x532ffb]),
                typeof _0x532ffb == _0x3ae563(0x12a) &&
                  (_0x532ffb = _0x42240d[_0x3ae563(0x109)](_0x4fdb7b))),
            _0x532ffb == "\x0a"
              ? (_0x544afb["push"](
                  _0x296ed5[_0x3ae563(0x128)]()[_0x3ae563(0x107)]("")
                ),
                (_0x296ed5 = []))
              : _0x296ed5[_0x3ae563(0xfc)](_0x532ffb);
        }
        return (
          _0x544afb[_0x3ae563(0xfc)](_0x296ed5["reverse"]()["join"]("")),
          _0x544afb[_0x3ae563(0x107)]("\x0a")
        );
      },
      decode: function (_0x4a278b) {
        var _0xe95f03 = _0x459c,
          _0x152698 = [],
          _0x284694,
          _0x2867ab = [];
        for (
          var _0xccfb29 = 0x0, _0x1b686b = _0x4a278b["length"];
          _0xccfb29 < _0x1b686b;
          _0xccfb29++
        ) {
          (_0x284694 = _0x4a278b[_0xe95f03(0x109)](_0xccfb29)),
            _0xccfb29 > 0x0 &&
            (_0x284694 == "̈" ||
              _0x284694 == "̀" ||
              _0x284694 == "́" ||
              _0x284694 == "̂")
              ? ((_0x284694 =
                  this["map"][
                    _0x4a278b[_0xe95f03(0x109)](_0xccfb29 - 0x1) + _0x284694
                  ]),
                _0x152698["pop"]())
              : ((_0x284694 = this["map"][_0x284694]),
                typeof _0x284694 == "undefined" &&
                  (_0x284694 = _0x4a278b[_0xe95f03(0x109)](_0xccfb29))),
            _0x284694 == "\x0a"
              ? (_0x2867ab[_0xe95f03(0xfc)](
                  _0x152698[_0xe95f03(0x128)]()[_0xe95f03(0x107)]("")
                ),
                (_0x152698 = []))
              : _0x152698[_0xe95f03(0xfc)](_0x284694);
        }
        return (
          _0x2867ab[_0xe95f03(0xfc)](
            _0x152698[_0xe95f03(0x128)]()[_0xe95f03(0x107)]("")
          ),
          _0x2867ab[_0xe95f03(0x107)]("\x0a")
        );
      },
      map: {
        a: "ɒ",
        b: "d",
        c: "ɔ",
        e: "ɘ",
        f: "Ꮈ",
        g: "ǫ",
        h: "ʜ",
        j: "ꞁ",
        k: "ʞ",
        l: "|",
        n: "ᴎ",
        p: "q",
        r: "ɿ",
        s: "ꙅ",
        t: "ƚ",
        y: "ʏ",
        z: "ƹ",
        B: "ᙠ",
        C: "Ɔ",
        D: "ᗡ",
        E: "Ǝ",
        F: "ꟻ",
        G: "Ꭾ",
        J: "Ⴑ",
        K: "⋊",
        L: "⅃",
        N: "Ͷ",
        P: "ꟼ",
        Q: "Ọ",
        R: "Я",
        S: "Ꙅ",
        Z: "Ƹ",
        0x1: "",
        0x2: "",
        0x3: "",
        0x4: "",
        0x5: "",
        0x6: "",
        0x7: "",
        "&": "",
        ";": "",
        "[": "]",
        "(": ")",
        "{": "}",
        "?": "⸮",
        "<": ">",
        ä: "ɒ̈",
        ß: "ᙠ",
        "´": "`",
        é: "ɘ̀",
        á: "ɒ̀",
        ó: "ò",
        ú: "ù",
        É: "Ǝ̀",
        Á: "À",
        Ó: "Ò",
        Ú: "Ù",
        "`": "´",
        è: "ɘ́",
        à: "ɒ́",
        È: "Ǝ́",
        ê: "ɘ̂",
        â: "ɒ̂",
        Ê: "Ǝ̂",
        Ø: "ᴓ",
        ø: "ᴓ",
      },
    },
    creepify: {
      init: function () {
        var _0x1fb3e3 = _0x459c;
        for (var _0x26488a = 0x300; _0x26488a <= 0x315; _0x26488a++) {
          this["diacriticsTop"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](_0x26488a)
          );
        }
        for (var _0x26488a = 0x316; _0x26488a <= 0x333; _0x26488a++) {
          _0x26488a != 0x31a &&
            _0x26488a != 0x31b &&
            this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
              String[_0x1fb3e3(0x103)](_0x26488a)
            );
        }
        this["diacriticsTop"][_0x1fb3e3(0xfc)](String["fromCharCode"](0x31a)),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x31b)
          );
        for (var _0x26488a = 0x334; _0x26488a <= 0x338; _0x26488a++) {
          this[_0x1fb3e3(0xfd)]["push"](String["fromCharCode"](_0x26488a));
        }
        for (var _0x26488a = 0x339; _0x26488a <= 0x33c; _0x26488a++) {
          this["diacriticsBottom"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](_0x26488a)
          );
        }
        for (var _0x26488a = 0x33d; _0x26488a <= 0x344; _0x26488a++) {
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](_0x26488a)
          );
        }
        this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
          String[_0x1fb3e3(0x103)](0x344)
        ),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String["fromCharCode"](0x345)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String["fromCharCode"](0x346)
          ),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String["fromCharCode"](0x347)
          ),
          this[_0x1fb3e3(0x138)]["push"](String[_0x1fb3e3(0x103)](0x348)),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x349)
          ),
          this[_0x1fb3e3(0x114)]["push"](String[_0x1fb3e3(0x103)](0x34a)),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x34b)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x34c)
          ),
          this["diacriticsBottom"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x34d)
          ),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x34e)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x350)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String["fromCharCode"](0x351)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x352)
          ),
          this["diacriticsBottom"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x353)
          ),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String["fromCharCode"](0x354)
          ),
          this["diacriticsBottom"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x355)
          ),
          this["diacriticsBottom"]["push"](String[_0x1fb3e3(0x103)](0x356)),
          this["diacriticsTop"]["push"](String[_0x1fb3e3(0x103)](0x357)),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x358)
          ),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x359)
          ),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x35a)
          ),
          this[_0x1fb3e3(0x114)]["push"](String["fromCharCode"](0x35b)),
          this[_0x1fb3e3(0x138)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x35c)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x35d)
          ),
          this["diacriticsTop"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x35d)
          ),
          this["diacriticsBottom"][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x35f)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String["fromCharCode"](0x360)
          ),
          this[_0x1fb3e3(0x114)][_0x1fb3e3(0xfc)](
            String[_0x1fb3e3(0x103)](0x361)
          );
      },
      encode: function (_0x1c3f0c) {
        var _0x45b516 = _0x459c,
          _0xd07e2 = "",
          _0x1e09d0;
        for (i in _0x1c3f0c) {
          _0x1e09d0 = _0x1c3f0c[i];
          this["options"][_0x45b516(0x130)] &&
            (_0x1e09d0 +=
              this[_0x45b516(0xfd)][
                Math["floor"](
                  Math[_0x45b516(0x112)]() *
                    this[_0x45b516(0xfd)][_0x45b516(0x137)]
                )
              ]);
          if (this["options"][_0x45b516(0x13d)]) {
            var _0x1c2228 = this[_0x45b516(0x114)]["length"] - 0x1;
            for (
              var _0x3de167 = 0x0,
                _0x1cf3aa =
                  this["options"]["maxHeight"] -
                  Math[_0x45b516(0x112)]() *
                    ((this[_0x45b516(0x13b)][_0x45b516(0x10e)] / 0x64) *
                      this[_0x45b516(0x13b)][_0x45b516(0x101)]);
              _0x3de167 < _0x1cf3aa;
              _0x3de167++
            ) {
              _0x1e09d0 +=
                this[_0x45b516(0x114)][
                  Math[_0x45b516(0x12d)](Math[_0x45b516(0x112)]() * _0x1c2228)
                ];
            }
          }
          if (this[_0x45b516(0x13b)][_0x45b516(0x12b)]) {
            var _0x5f0ff0 = this[_0x45b516(0x138)][_0x45b516(0x137)] - 0x1;
            for (
              var _0x3de167 = 0x0,
                _0x1cf3aa =
                  this[_0x45b516(0x13b)][_0x45b516(0x101)] -
                  Math[_0x45b516(0x112)]() *
                    ((this[_0x45b516(0x13b)][_0x45b516(0x10e)] / 0x64) *
                      this[_0x45b516(0x13b)][_0x45b516(0x101)]);
              _0x3de167 < _0x1cf3aa;
              _0x3de167++
            ) {
              _0x1e09d0 +=
                this[_0x45b516(0x138)][
                  Math[_0x45b516(0x12d)](Math[_0x45b516(0x112)]() * _0x5f0ff0)
                ];
            }
          }
          _0xd07e2 += _0x1e09d0;
        }
        return _0xd07e2;
      },
      decode: function (_0x508eee) {
        var _0x89a73e = "",
          _0x5a3e6a;
        for (i in _0x508eee) {
          (_0x5a3e6a = _0x508eee[i]["charCodeAt"](0x0)),
            (_0x5a3e6a < 0x300 || _0x5a3e6a > 0x361) &&
              (_0x89a73e += _0x508eee[i]);
        }
        return _0x89a73e;
      },
      diacriticsTop: [],
      diacriticsMiddle: [],
      diacriticsBottom: [],
      options: {
        top: !![],
        middle: !![],
        bottom: !![],
        maxHeight: 0xf,
        randomization: 0x64,
      },
    },
    bubbles: {
      init: function () {
        var _0x4b80d5 = _0x459c;
        for (var _0x10428a = 0x31; _0x10428a <= 0x39; _0x10428a++) {
          this["map"][String[_0x4b80d5(0x103)](_0x10428a)] = String[
            _0x4b80d5(0x103)
          ](_0x10428a + 0x242f);
        }
        this[_0x4b80d5(0x105)]["0"] = "⓪";
        for (var _0x10428a = 0x41; _0x10428a <= 0x5a; _0x10428a++) {
          this["map"][String[_0x4b80d5(0x103)](_0x10428a)] = String[
            "fromCharCode"
          ](_0x10428a + 0x2475);
        }
        for (var _0x10428a = 0x61; _0x10428a <= 0x7a; _0x10428a++) {
          this[_0x4b80d5(0x105)][String["fromCharCode"](_0x10428a)] = String[
            _0x4b80d5(0x103)
          ](_0x10428a + 0x246f);
        }
        for (_0x10428a in this[_0x4b80d5(0x105)]) {
          this["mapInverse"][this[_0x4b80d5(0x105)][_0x10428a]] = _0x10428a;
        }
      },
      encode: function (_0x3662c2) {
        var _0x3ae917 = _0x459c,
          _0x38d7ae = "",
          _0xb16e1,
          _0x2568fa = !![];
        for (i in _0x3662c2) {
          (_0xb16e1 = this[_0x3ae917(0x105)][_0x3662c2[i]]),
            typeof _0xb16e1 == "undefined" &&
              (_0x3662c2[i]["charCodeAt"](0x0) >= 0x21
                ? ((_0xb16e1 = _0x3662c2[i] + String[_0x3ae917(0x103)](0x20dd)),
                  !_0x2568fa &&
                    (_0xb16e1 =
                      String[_0x3ae917(0x103)](0x202f) +
                      String[_0x3ae917(0x103)](0xa0) +
                      String[_0x3ae917(0x103)](0xa0) +
                      String[_0x3ae917(0x103)](0x202f) +
                      _0xb16e1))
                : (_0xb16e1 = _0x3662c2[i])),
            (_0x38d7ae += _0xb16e1),
            (_0x2568fa = _0xb16e1 == "\x0a");
        }
        return _0x38d7ae;
      },
      decode: function (_0x1e9f5d) {
        var _0x1ccc28 = _0x459c,
          _0x31a047 = "",
          _0x4676f3,
          _0x303f73 = "";
        for (i in _0x1e9f5d) {
          (_0x4676f3 = this[_0x1ccc28(0x131)][_0x1e9f5d[i]]),
            (_0x31a047 +=
              typeof _0x4676f3 == _0x1ccc28(0x12a) ? _0x1e9f5d[i] : _0x4676f3);
        }
        for (i in _0x31a047) {
          (_0x4676f3 = _0x31a047[i]["charCodeAt"](0x0)),
            _0x4676f3 != 0xa0 &&
              _0x4676f3 != 0x202f &&
              _0x4676f3 != 0x20dd &&
              (_0x303f73 += _0x31a047[i]);
        }
        return _0x303f73;
      },
      map: {},
      mapInverse: {},
    },
    squares: {
      init: function () {},
      encode: function (_0x257987) {
        var _0xb2c41c = _0x459c,
          _0x3155a9 = "",
          _0x1a4038,
          _0x11db16 = !![];
        for (i in _0x257987) {
          _0x257987[i]["charCodeAt"](0x0) >= 0x21
            ? ((_0x1a4038 = _0x257987[i] + String["fromCharCode"](0x20de)),
              !_0x11db16 &&
                (_0x1a4038 =
                  String[_0xb2c41c(0x103)](0x202f) +
                  String["fromCharCode"](0xa0) +
                  String[_0xb2c41c(0x103)](0xa0) +
                  String[_0xb2c41c(0x103)](0x202f) +
                  _0x1a4038))
            : (_0x1a4038 = _0x257987[i]),
            (_0x3155a9 += _0x1a4038),
            (_0x11db16 = _0x1a4038 == "\x0a");
        }
        return _0x3155a9;
      },
      decode: function (_0x5aab4c) {
        var _0x16d508 = _0x459c,
          _0x227eca = "",
          _0xdd4e43;
        for (i in _0x5aab4c) {
          (_0xdd4e43 = _0x5aab4c[i][_0x16d508(0x135)](0x0)),
            _0xdd4e43 != 0xa0 &&
              _0xdd4e43 != 0x202f &&
              _0xdd4e43 != 0x20de &&
              (_0x227eca += _0x5aab4c[i]);
        }
        return _0x227eca;
      },
    },
    roundsquares: {
      init: function () {},
      encode: function (_0x41387a) {
        var _0x4e1a60 = _0x459c,
          _0x14bd97 = "",
          _0x3e392c,
          _0x33b2d9 = !![];
        for (i in _0x41387a) {
          _0x41387a[i][_0x4e1a60(0x135)](0x0) >= 0x21
            ? ((_0x3e392c = _0x41387a[i] + String[_0x4e1a60(0x103)](0x20e3)),
              !_0x33b2d9 &&
                (_0x3e392c =
                  String[_0x4e1a60(0x103)](0xa0) +
                  String[_0x4e1a60(0x103)](0xa0) +
                  String[_0x4e1a60(0x103)](0xa0) +
                  _0x3e392c))
            : (_0x3e392c = _0x41387a[i]),
            (_0x14bd97 += _0x3e392c),
            (_0x33b2d9 = _0x3e392c == "\x0a");
        }
        return _0x14bd97;
      },
      decode: function (_0x353d52) {
        var _0xdc7bcb = _0x459c,
          _0x3c097f = "",
          _0xdfdbf;
        for (i in _0x353d52) {
          (_0xdfdbf = _0x353d52[i][_0xdc7bcb(0x135)](0x0)),
            _0xdfdbf != 0xa0 &&
              _0xdfdbf != 0x202f &&
              _0xdfdbf != 0x20e3 &&
              (_0x3c097f += _0x353d52[i]);
        }
        return _0x3c097f;
      },
    },
    bent: {
      init: function () {
        for (i in this["map"]) {
          this["map"][this["map"][i]] = i;
        }
      },
      encode: function (_0x112caa) {
        var _0xa0ba50 = _0x459c,
          _0x5ecebb = "",
          _0x1b4b99;
        for (
          var _0x7d5a37 = 0x0, _0x1722a0 = _0x112caa["length"];
          _0x7d5a37 < _0x1722a0;
          _0x7d5a37++
        ) {
          (_0x1b4b99 = this[_0xa0ba50(0x105)][_0x112caa["charAt"](_0x7d5a37)]),
            typeof _0x1b4b99 == "undefined" &&
              (_0x1b4b99 = _0x112caa["charAt"](_0x7d5a37)),
            (_0x5ecebb += _0x1b4b99);
        }
        return _0x5ecebb;
      },
      decode: function (_0x2493f5) {
        var _0x1c11f7 = _0x459c,
          _0x33c7ea = "",
          _0x110d76;
        for (
          var _0x78daab = 0x0, _0x1abeb8 = _0x2493f5[_0x1c11f7(0x137)];
          _0x78daab < _0x1abeb8;
          _0x78daab++
        ) {
          (_0x110d76 =
            this[_0x1c11f7(0x105)][_0x2493f5[_0x1c11f7(0x109)](_0x78daab)]),
            typeof _0x110d76 == _0x1c11f7(0x12a) &&
              (_0x110d76 = _0x2493f5[_0x1c11f7(0x109)](_0x78daab)),
            (_0x33c7ea += _0x110d76);
        }
        return _0x33c7ea;
      },
      map: {
        a: "ą",
        b: "ҍ",
        c: "ç",
        d: "ժ",
        e: "ҽ",
        f: "ƒ",
        g: "ց",
        h: "հ",
        i: "ì",
        j: "ʝ",
        k: "ҟ",
        l: "Ӏ",
        m: "ʍ",
        n: "ղ",
        o: "օ",
        p: "ք",
        q: "զ",
        r: "ɾ",
        s: "ʂ",
        t: "է",
        u: "մ",
        v: "ѵ",
        w: "ա",
        x: "×",
        y: "վ",
        z: "Հ",
        A: "Ⱥ",
        B: "β",
        C: "↻",
        D: "Ꭰ",
        E: "Ɛ",
        F: "Ƒ",
        G: "Ɠ",
        H: "Ƕ",
        I: "į",
        J: "ل",
        K: "Ҡ",
        L: "Ꝉ",
        M: "Ɱ",
        N: "ហ",
        O: "ට",
        P: "φ",
        Q: "Ҩ",
        R: "འ",
        S: "Ϛ",
        T: "Ͳ",
        U: "Ա",
        V: "Ỽ",
        W: "చ",
        X: "ჯ",
        Y: "Ӌ",
        Z: "ɀ",
        0x0: "⊘",
        0x1: _0x355f23(0x11a),
        0x2: "ϩ",
        0x3: "Ӡ",
        0x4: "५",
        0x5: "Ƽ",
        0x6: "Ϭ",
        0x7: "7",
        0x8: "������",
        0x9: "९",
        "&": "⅋",
        "(": "{",
        ")": "}",
        "{": "(",
        "}": ")",
        ä: "ą̈",
        ö: "օ̈",
        ü: "մ̈",
        Ä: "Ⱥ̈",
        Ö: "ට̈",
        Ü: "Ա̈",
        é: "ҽ́",
        á: "ą́",
        ó: "օ́",
        ú: "մ́",
        É: "Ɛ́",
        Á: "Ⱥ́",
        Ó: "ට́",
        Ú: "Ա́",
        è: "ҽ̀",
        à: "ą̀",
        ò: "օ̀",
        ù: "մ̀",
        È: "Ɛ̀",
        À: "Ⱥ̀",
        Ò: "ට̀",
        Ù: "Ա̀",
        ê: "ҽ̂",
        â: "ą̂",
        ô: "օ̂",
        û: "մ̂",
        Ê: "Ɛ̂",
        Â: "Ⱥ̂",
        Ô: "ට̂",
        Û: "Ա̂",
      },
    },
    tiny: {
      init: function () {
        var _0x227fdf = _0x355f23;
        for (i in this[_0x227fdf(0x105)]) {
          this[_0x227fdf(0x105)][this[_0x227fdf(0x105)][i]] = i;
        }
      },
      encode: function (_0x5764cb) {
        var _0x57445b = _0x355f23,
          _0x4d81d0 = "",
          _0x5173d2;
        _0x5764cb = _0x5764cb["toUpperCase"]();
        for (
          var _0x4e81b2 = 0x0, _0x49ca66 = _0x5764cb["length"];
          _0x4e81b2 < _0x49ca66;
          _0x4e81b2++
        ) {
          (_0x5173d2 = this[_0x57445b(0x105)][_0x5764cb["charAt"](_0x4e81b2)]),
            typeof _0x5173d2 == _0x57445b(0x12a) &&
              (_0x5173d2 = _0x5764cb["charAt"](_0x4e81b2)),
            (_0x4d81d0 += _0x5173d2);
        }
        return _0x4d81d0;
      },
      decode: function (_0x1b07fd) {
        var _0x243891 = _0x355f23,
          _0x3b8424 = "",
          _0x4f0e2f;
        for (
          var _0x23e78d = 0x0, _0x5a9470 = _0x1b07fd[_0x243891(0x137)];
          _0x23e78d < _0x5a9470;
          _0x23e78d++
        ) {
          (_0x4f0e2f = this["map"][_0x1b07fd[_0x243891(0x109)](_0x23e78d)]),
            typeof _0x4f0e2f == _0x243891(0x12a) &&
              (_0x4f0e2f = _0x1b07fd[_0x243891(0x109)](_0x23e78d)),
            (_0x3b8424 += _0x4f0e2f);
        }
        return _0x3b8424;
      },
      map: {
        A: "ᴀ",
        B: "ʙ",
        C: "ᴄ",
        D: "ᴅ",
        E: "ᴇ",
        F: "ꜰ",
        G: "ɢ",
        H: "ʜ",
        I: "ɪ",
        J: "ᴊ",
        K: "ᴋ",
        L: "ʟ",
        M: "ᴍ",
        N: "ɴ",
        O: "ᴏ",
        P: "ᴘ",
        Q: "Q",
        R: "ʀ",
        S: "ꜱ",
        T: "ᴛ",
        U: "ᴜ",
        V: "ᴠ",
        W: "ᴡ",
        X: "x",
        Y: "ʏ",
        Z: "ᴢ",
      },
    },
  };
  for (i in this[_0x355f23(0x147)]) {
    this["tools"][i]["init"]();
  }
  this[_0x355f23(0x125)] = function (_0x38ddae) {
    var _0x2a5164 = _0x355f23,
      _0x3361ef = "",
      _0x53f5c3,
      _0x2fa2f2 = !![],
      _0x53e91b = 0x0,
      _0x142f2b = 0x0;
    for (
      var _0x38f478 = 0x0, _0x8e0d4e = _0x38ddae[_0x2a5164(0x137)];
      _0x38f478 < _0x8e0d4e;
      _0x38f478++
    ) {
      _0x53f5c3 = _0x38ddae[_0x2a5164(0x135)](_0x38f478);
      if (_0x53f5c3 == 0xa || _0x53f5c3 == 0xd)
        (_0x3361ef += _0x2a5164(0x12e)), (_0x2fa2f2 = !![]);
      else {
        if (_0x53f5c3 == 0x20)
          _0x2fa2f2
            ? ((_0x3361ef += "\x20"), (_0x2fa2f2 = ![]))
            : ((_0x3361ef += _0x2a5164(0x121)), (_0x2fa2f2 = !![]));
        else {
          if (_0x53f5c3 >= 0xd800 && _0x53f5c3 <= 0xdbff)
            (_0x53e91b = _0x53f5c3), (_0x142f2b = 0x0);
          else
            _0x53e91b > 0x0
              ? (_0x53f5c3 >= 0xdc00 &&
                  _0x53f5c3 <= 0xdfff &&
                  (_0x142f2b =
                    (_0x53e91b - 0xd800) * 0x400 +
                    (_0x53f5c3 - 0xdc00) +
                    0x10000),
                (_0x53e91b = 0x0))
              : (_0x142f2b = _0x53f5c3);
          _0x142f2b != 0x0 &&
            ((_0x3361ef +=
              _0x2a5164(0x142) + _0x142f2b[_0x2a5164(0x149)](0x10) + ";"),
            (_0x2fa2f2 = !![]));
        }
      }
    }
    return _0x3361ef;
  };
}
module[_0x351ba0(0x12f)] = {
  StyleText: new StyleText(),
  randomStyle: (_0xaa55f2) => {
    var _0x1b07b2 = _0x351ba0;
    let _0x421300 = listall(_0xaa55f2);
    return _0x421300[
      Math[_0x1b07b2(0x12d)](Math["random"]() * _0x421300[_0x1b07b2(0x137)])
    ];
  },
  listall: listall,
  strikeThrough: strikeThrough,
  wingdings: wingdings,
  vaporwave: vaporwave,
  typewriter: typewriter,
  analucia: analucia,
  tildeStrikeThrough: tildeStrikeThrough,
  underline: underline,
  doubleUnderline: doubleUnderline,
  slashThrough: slashThrough,
  sparrow: sparrow,
  heartsBetween: heartsBetween,
  arrowBelow: arrowBelow,
  crossAboveBelow: crossAboveBelow,
  creepify: creepify,
  bubbles: bubbles,
  mirror: mirror,
  squares: squares,
  roundsquares: roundsquares,
  flip: flip,
  tiny: tiny,
  createMap: createMap,
  serif_I: serif_I,
  manga: manga,
  ladybug: ladybug,
  runes: runes,
  serif_B: serif_B,
  serif_BI: serif_BI,
  serif_I: serif_I,
  fancy1: fancy1,
  fancy2: fancy2,
  fancy3: fancy3,
  fancy4: fancy4,
  fancy5: fancy5,
  fancy6: fancy6,
  fancy7: fancy7,
  fancy8: fancy8,
  fancy9: fancy9,
  fancy10: fancy10,
  fancy11: fancy11,
  fancy12: fancy12,
  fancy13: fancy13,
  fancy14: fancy14,
  fancy15: fancy15,
  fancy16: fancy16,
  fancy17: fancy17,
  fancy18: fancy18,
  fancy19: fancy19,
  fancy20: fancy20,
  fancy21: fancy21,
  fancy22: fancy22,
  fancy23: fancy23,
  fancy24: fancy24,
  fancy25: fancy25,
  fancy26: fancy26,
  fancy27: fancy27,
  fancy28: fancy28,
  fancy29: fancy29,
  fancy30: fancy30,
  fancy31: fancy31,
  fancy32: fancy32,
  fancy33: fancy33,
};
